<?php 
return [
  // Common
  'messages' => [
    'settings_saved'            => 'Налаштування збережені',
    'contacts_saved'            => 'Контакти збережені',
    'homepage_saved'            => 'Головна сторінка збережена',
    'file_saved'                => 'Файл збережено',
    'error_saving_file'         => 'Помилка при збереженні файлу',
    'delete_restricted_title'   => 'Увага! Ви не можете це видалити через інші залежні дані!',
    'delete_cascade_warning'    => 'Увага! Якщо ви видалите цеб інші залежні дані також будуть видалені!',
  ],
'orders' => [
    'statuses' => [
      'navigation_label'      => 'Статуси',
      'model_label_singular'  => 'Статус',
      'fields' => [
        'name'            => 'Назва статусу',
        'color'           => 'Колір статусу',
        'icon'            => 'Іконка',
        'notification'    => 'Сповістити клієнта',
        'is_default'      => 'За замовчуванням',
        'is_paid'         => 'Сплачений',
        'is_shipped'      => 'Доставлено',
        'is_finished'     => 'Завершено',
        'is_active'       => 'Активний',
      ],
    ],
  ],
  'catalog' => [
    'products' => [
      'navigation_label'      => 'Товари',
      'model_label_singular'  => 'Товар',
      'fields' => [
        'global_name'           => 'Глобальна назва',
        'global_data'           => 'Глобальні дані',
        'sku'                   => 'Артикул (SKU)',
        'store_name'            => 'Назва в магазині',
        'attributes'            => 'Атрибути',
        'options'               => 'Опції',
        'tags'                  => 'Теги',
        'price_tiers'           => 'Групи цін',
        'prices'                => 'Ціни',
        'price'                 => 'Ціна',
        'price_name'            => 'Назва ціни',
        'price_terms'           => 'Умови ціни',
        'discount'              => 'Знижка',
        'is_active'             => 'Активний у цьому магазині',
        'is_not_active'         => 'Неактивний у цьому магазині',
        'is_not_associated'     => 'Не пов’язаний з цим магазином',
        'prices_customer_group' => 'Група клієнтів',
        'customer_group_id_short' => 'Кліенти',
        'valid_from'            => 'Ціна дійсна з дати',
        'valid_until'           => 'Ціна дійсна по дату',
        'valid_from_short'      => 'з',
        'valid_until_short'     => 'по',
        'valid_quantity'        => 'Кількість для застосування ціни',
        'valid_quantity_short'  => 'від кількості',
        'priority'              => 'Пріоритет',
        'parent_id'             => 'Основна категорія',
        'product_categories'    => 'Інші категорії',
        'category'              => 'Категория',
        'manufacturer_id'       => 'Виробник',
        'manufacturers'         => 'Виробники',
        'product_tags'          => 'Теги товару',
        'tag'                   => 'Тег',
        'stock_subtract'        => 'Віднімати зі складу'
      ],
      'tabs' => [
        'prices'                => 'Ціни',
        'categories'            => 'Категорії',
        'manufacturers'         => 'Виробники',
        'tags'                  => 'Теги',
        'attributes'            => 'Атрибути',
        'options'               => 'Опції',
      ],
      'helpers' => [
        'global_data'           => 'Спільні дані для кожного магазину, де є цей товар - редагування тут змінить їх усюди',
        'global_name'           => 'Відображається лише в панелі адміністратора. Використовується для швидкого пошуку товару',
        'sku'                   => 'Відображається в панелі адміністратора та на вітрині (якщо увімкнено відповідне налаштування магазину). Використовується для швидкого пошуку товару',
        'is_active'             => 'Статус товару в поточному магазині',
        'prices_customer_group' => 'Виберіть групу клієнтів, до якої буде застосовуватися ця ціна',
        'priority'              => 'Якщо кілька цін мають схожі умови застосування, буде використано ціну з вищим пріоритетом',
        'discount'              => 'Знижка має пріоритет над звичайною ціною',
        'valid_from'            => 'Ціна активна з цієї дати',
        'valid_until'           => 'Ціна активна по цю дату',
        'valid_quantity'        => 'Кількість товару в кошику для застосування цієї ціни',
        'price_name'            => 'Відображається поруч із ціною як бейдж, наприклад "Фінальний розпродаж". Можна залишити порожнім',
        'parent_id'             => 'Головна категорія товару для створення шляху URL товару',
        'manufacturer_id'       => 'Посилання на виробника товару, отображається на сторінці товару',
        'facet_categories'      => 'Виберіть категорії, в яких відображатиметься товар. Якщо не вибрати жодної, то товар не відображатиметься в жодній категорії',
        'facet_manufacturers'   => 'Виберіть виробників, в яких буде відображено товар. Якщо не вибрати жодного, то товар не відображатиметься в жодному виробнику',
        'status'                => 'Статус товару застосовується лише для поточного магазину',
        'facet_tags'            => 'Тег товару - це додатковий спосіб групування товарів для їх відображення на SEO сторінці фільтра. Їх також можна відображати як бейджи на мініатюрі товару та головному зображенні товару',
      ],
      'buttons' => [
        'add_price_tier'        => 'Додати групу цін',
        'add_attribute'         => 'Додати атрибут товару',
        'add_option'            => 'Додати опцію',
        'add_option_value'      => 'Додати значеня опції',
        'add_attribute_value'   => 'Додати значеня атрибута',
        'add_tag'               => 'Додати тег товару',
        'add_category'          => 'Додати категорію',
        'add_manufacturer'      => 'Додати виробника',
        'delete_from_store'     => 'Видалити з цього магазина',
        'delete_from_all_stores'=> 'Видалити з усіх магазинів',
        'edit_product'          => 'Редактировать товар'
      ],
      'messages' => [ 
        'delete_from_store'       => 'Ця дія видалить товар з поточного магазину, але не видаляє з інших магазинів. Усі дані у поточному магазині товару будуть видалені. Ця дія необоротна. Продовжити?', 
        'delete_from_all_stores'  => 'Ця дія видалить товар з усіх магазинів. Усі дані товару будуть видалені з усіх магазинів. Ця дія необоротна. Продовжити?', 
      ],
      'errors' => [
        'last_price_text'   => 'Товар повинен мати щонайменше одну ціну',
      ]
    ],
    'categories' => [
      'navigation_label'      => 'Категорії',
      'model_label_singular'  => 'Категорія',
      'fields' => [
        'is_active'       => 'Активна',
        'is_root'         => 'Коренева',
        'show_in_facets'  => 'Відображати у фільтрі',
        'parent_id'       => 'Батьківська категорія',
      ],
      'helpers' => [
        'parent_id'       => 'Виберіть батьківську категорію або залиште порожнім, щоб зробити цю категорію кореневою'
      ],
    ],
    'manufacturers' => [
      'navigation_label'      => 'Виробники',
      'model_label_singular'  => 'Виробник',
      'fields'  => [
        'is_active'       => 'Активний',
        'is_root'         => 'Кореневий',
        'show_in_facets'  => 'Відображати у фільтрі',
        'parent_id'       => 'Батьківський виробник',
      ],
      'helpers' => [
        'parent_id'       => 'Виберіть батьківського виробника або залиште порожнім, щоб зробити цього виробника кореневим'
      ],
    ],
    'attributes' => [
      'navigation_label'        => 'Атрибути',
      'model_label_singular'    => 'Атрибут',
      'fields'  => [
        'group_title'           => 'Атрибут',
        'group'                 => 'Група',
        'group_name'            => 'Назва групи атрибутів',
        'values'                => 'Значення атрибутів',
        'image'                 => 'Картинка',
        'description'           => 'Опис атрибута',
        'attribute_name'        => 'Назва атрибута',
        'slug'                  => 'URL',
        'show_in_facets'        => 'Відображати в фильтрі',
        'is_active'             => 'Активний',
      ],
      'helpers' => [
        'title_helper'          => 'Атрибути - це незмінні властивості товару. Відображаються на сторінці товару у вигляді таблиці',
        'group_name'            => 'Назва групи буде відображатись у фільтрі як батьківський елемент для значень атрибутів',
        'is_active'             => 'Показувати цю групу атрибутів на сторінці товару та у фільтрі',
        'show_in_facets'        => 'Показувати цю групу атрибутів у фільтрі',
        'value_is_active'       => 'Показувати це значення атрибуту на сторінці товару та у фільтрі',
        'value_show_in_facets'  => 'Показувати це значення атрибуту у фільтрі',
        'description'           => 'Цей опис буде відображатися на сторінці товару. Його можна змінити індивідуально для кожного товару в налаштуваннях товару'
      ],
      'buttons' => [
        'add_attribute_value' => 'Додати значення атрибута'
      ]
    ],
    'options' => [
      'navigation_label'      => 'Опції',
      'model_label_singular'  => 'Опція',
      'fields'  => [
        'group_title'           => 'Опція',
        'group'                 => 'Група',
        'group_name'            => 'Назва групи опцій',
        'values'                => 'Значення опцій',
        'image'                 => 'Зображення',
        'description'           => 'Опис',
        'option_name'           => 'Назва опції',
        'slug'                  => 'URL',
        'show_in_facets'        => 'Відображати у фільтрі',
        'is_active'             => 'Активна',
        'is_default'            => 'Вибрана за замовчуванням',
        'type'                  => 'Тип опції',
        'radio'                 => 'Перемикач',
        'checkbox'              => 'Чекбокс',
      ],
      'helpers' => [
        'group_title'           => 'Опції - це змінні властивості товару. Вони впливають на ціну товару, артикул, наявність і вагу. Тут ви можете додати список доступних опцій. Щоб прив\'язати їх до товару, перейдіть на сторінку налаштувань товару',
        'group_name'            => 'Назва групи відображатиметься у фасетному фільтрі як батьківський елемент значень опцій',
        'is_active'             => 'Показувати цю групу на сторінці товару та в блоці фільтрів',
        'show_in_facets'        => 'Показувати цю групу в блоці фільтрів',
        'value_is_active'       => 'Показувати це значення опції на сторінках товару',
        'value_show_in_facets'  => 'Показувати це значення опції в блоці фільтрів',
        'is_default'            => 'Встановити це значення вибраним за замовчуванням. Може бути перевизначено налаштуваннями товару',
        'type'                  => 'Тип опції визначає спосіб її вибору: одна зі списку (перемикач) або кілька (чекбокс)',
      ],
      'buttons' => [
        'add_attribute_value' => 'Додати значення опції'
      ]
    ],
    'tags' => [
      'navigation_label'      => 'Теги',
      'model_label_singular'  => 'Тег',
      'fields' => [
        'show_in_facets'  => 'Відображати у фільтрі',
        'is_active'       => 'Активний',
        'inline_style'    => 'Вбудований CSS стиль',
      ],
      'helpers' => [
        'is_active'       => 'Показувати цей тег на сторінці товару та у фільтрі',
        'show_in_facets'  => 'Показувати цей тег у фільтрі',
        'inline_style'    => 'Вбудований стиль буде застосований до тега на сторінках товарів та в мініатюрах',
      ],
    ],
    'facet_pages' => [
      'navigation_label'      => 'Сторінки фільтра',
      'model_label_singular'  => 'Сторінка фільтра',
      'fields' => [
        'is_active'         => 'Активна',
        'facet_list'        => 'Список фільтрів',
        'facet_index'       => 'Список фільтрів',
        'root_facet'        => 'Основний фільтр',
        'additional_facets' => 'Додаткові фільтри'
      ],
      'buttons' => [
        'add_facet'   => 'Додати фільтр'
      ],
      'errors' => [
        'duplicate_combination'   => 'Така комбинація фильтрів вже існує',
        'root_facet_not_selected' => 'Виберіть одну категирію або одного виробника для цієї Сторінки фільтра',
        'facet_type_required'     => 'Виберіть тип фільтра',
        'facet_value_required'    => 'Виберіть значення фільтра',
      ],
      'helpers' => [
        'root_facet'        => 'Основний фільтр визначає, який фільтр буде основним та обов\'язковим для цієї сторінки фільтрів',
        'additional_facets' => 'Додаткові фільтри визначають комбінацію інших фільтрів разом із основним фільтром для даної сторінки фільтрації',
      ]
    ],
    'facets' => [
      'types' => [
        'category'      => 'Категорія',
        'manufacturer'  => 'Виробник',
        'attribute'     => 'Атрибут',
        'option'        => 'Опція',
        'tag'           => 'Тег',
        'is_featured'   => 'Рекомендований',
        'has_discount'  => 'Зі знижкой',
        'bestseller'    => 'Лідер продажів',
        'best_reviews'  => 'Кращі відгуки',
      ]
    ],
    'product_reviews' => [
      'navigation_label'      => 'Відгуки про товари',
      'model_label_singular'  => 'Відгук про товар',
      'fields' => [
        'product'            => 'Товар',
        'type'               => 'Тип',        
        'author'             => 'Автор',
        'email'              => 'Email',
        'body'               => 'Текст відгуку',
        'rating'             => 'Рейтинг',
        'is_approved'        => 'Схвалено',
        'created_at'         => 'Дата створення',
        'reply_body'         => 'Відповідь',
        'locale'             => 'Мова',
        'thread'             => 'Гілка відповідей',
        'reply_author'       => 'Автор відповіді магазину',
        'positive_notes'     => 'Переваги',
        'negative_notes'     => 'Недоліки',
      ],
      'filters' => [
        'is_approved'        => 'Схвалено',
        'rating'             => 'Рейтинг',
        'no_reply'           => 'Без відповіді',
      ],
      'actions' => [
        'reply'              => 'Відповісти',
      ],
      'notifications' => [
        'reply_sent'         => 'Відповідь успішно відправлена',
      ],
      'buttons' => [
        'add_positive' => 'Додати перевагу',
        'add_negative' => 'Додати недолік',
      ],
      'labels' => [
        'admin_reply'        => 'Відповідь адміністратора',
        'customer_review'    => 'Відгук клієнта',
        'store_reply_author' => 'Автор відповіді магазину',
      ]
    ],
  ],
  'customers' => [
    'customer' => [
      'navigation_label'      => 'Покупці',
      'model_label_singular'  => 'Покупець',
      'fields' => [
        'customer'          => 'Покупець',
        'is_approved'       => 'Схвалений',
        'customer_group_id' => 'Група',
        'email'             => 'Email',
        'first_name'        => 'Ім\'я',
        'last_name'         => 'Прізвище',
        'phone'             => 'Телефон',
        'addresses'              => 'Адреси покупця',
        'addresses_label'        => 'Назва адреси',
        'addresses_placeholder'  => 'Наприклад: Дім, Робота',
        'is_default_shipping'    => 'Адреса доставки за замовченням',
        'is_default_billing'     => 'Адреса оплати за замовченням',
        'add_address'            => 'Додати адресу',
        'locale'            => 'Бажана мова покупця',
        'password'          => 'Пароль',
        'marketing_opt_in'  => 'Згода на маркетинг',
        'gdpr_consent_at'   => 'Згода GDPR',
        'anonymized_at'     => 'Дата анонімізації',
        'deleted_at'        => 'Дата видалення',
        'created_at'        => 'Дата реєстрації',
        'updated_at'        => 'Дата зміни',
        'presonal_data'     => 'Персональні дані',
        'store_data'        => 'Дані магазину',
        'email_data'        => 'Email',
        'email_verified_at' => 'Дата верифікації Email',
        'company_data'      => 'Компанія',
        'company_name'      => 'Назва компанії',
        'vat_number'        => 'Номер ІПН/ЕДРПОУ',
        'privacy_data'      => 'Конфіденційність',
        'anonymize'         => 'Анонімізувати дані'
      ],
      'messages' => [
        'anonymize_title'       => 'Анонімізувати дані користувача?',
        'anonymize_description' => 'Ця дія є незворотною. Усі персональні дані користувача будуть замінені на фіктивні заглушки',
        'anonymize_confirm'     => 'Я розумію, продовжити',
      ]
    ],
    'customer_groups' => [
      'navigation_label'      => 'Групи покупців',
      'model_label_singular'  => 'Група покупців',
      'fields' => [
        'name'                   => 'Назва',
        'code'                   => 'Тип',
        'price_modifier_percent' => 'Модифікатор ціни',
        'free_shipping'          => 'Безкоштовна доставка',
        'show_prices'            => 'Показувати ціни',
        'requires_approval'      => 'Потребує схвалення',
        'tax_exempt'             => 'Показувати податки',
        'is_default'             => 'За замовчуванням для нових користувачів',
        'sort_order'             => 'Порядок сортування',
        'is_active'              => 'Активна',
        'group_settings'         => 'Налаштування групи',
      ],
      'helpers' => [
        'price_modifier_percent' => 'Тут можна вказати позитивне або негативне значення, яке буде застосовано до всіх цін у вашому магазині',
        'code'                   => 'Загальний тип групи покупців, наприклад: нові, постійні, B2B тощо'
      ]
    ]
  ],
  'seo' => [
    'slugs' => [
      'model_label_singular'  => 'URL',
      'navigation_label'      => 'URLs',
      'fields' => [
        'url'                   => 'URL',
        'language'              => 'Мова',
        'type'                  => 'Тип',
        'id'                    => 'ID',
        'redirect'              => 'Редирект 301',
        'sluggable_id'          => 'ID сторінки',
        'robots'                => 'Тег robots',
        'index_follow'          => 'Index, Follow',
        'noindex_follow'        => 'Noindex, Follow',
        'index_nofollow'        => 'Index, Nofollow',
        'noindex_nofollow'      => 'Noindex, Nofollow',
      ],
      'helpers' => [
        'redirect'  => 'Переадресовувати запит з кодом 301 з поточного URL на цей',
        'is_active' => 'Якщо URL не активний, то і поточний URL, і Редирект буде віддавати код 410',
        'type'      => 'Тип сторінки, наприклад BlogPost, Product, ProductOption Category, Manufacturer і тощо',
        'id'        => 'ID сторінки щоб контролер знав яку саме сторінку відкривати',
        'robots'    => 'Тег robots потрібен для того, щоб вказувати пошуковим роботам, як цю сторінку потрібно додавати в пошуковий індекс',
      ],
      'errors' => [
        'slug_taken'              => 'Цей URL вже використовується',
        'alpha_dash'              => 'Дозволені тільки латинські літери, цифри і тире замість пробілів',
        'slug_duplicate_in_form'  => 'В цій формі дублюється URL', 
      ]
    ],
    'robots_editor' => [
      'navigation_label' => 'Robots.txt',
      'fields' => [
        'edit_robots_file'        => 'Редагувати robots.txt',
        'robots_file_description' => 'Кожен магазин має окремий файл robots.txt, вони не заважають один одному',
      ],
      'messages' => [
        'file_saved'        => 'Файл Robots.txt успішно збережено',
        'error_saving_file' => 'Помилка під час збереження файлу Robots.txt. Можливо, вам потрібно створити symlink або встановити CHMOD на папку зберігання',
      ],
    ],
    'keywords' => [ 
      'navigation_label' => 'Ключові слова', 
      'model_label_singular' => 'Ключове слово', 
      'js' => [ 
        'column_seo_keyword'          => 'Ключове слово', 
        'column_url'                  => 'URL', 
        'column_language'             => 'Мова', 
        'column_group'                => 'Група', 
        'column_add_keyword'          => 'Додати', 
        'column_edit_keyword'         => 'Редагувати', 
        'option_all_types'            => 'Всі типи', 
        'option_existing'             => 'Існуюче', 
        'option_updated'              => 'Оновлено', 
        'option_new'                  => 'Нове', 
        'option_imported'             => 'Імпортоване', 
        'button_add_row'              => 'Додати ключове слово', 
        'button_import'               => 'Імпорт CSV', 
        'button_save_all'             => 'Зберегти все', 
        'button_add_to_beginning'     => 'Додати в початок', 
        'button_add_to_end'           => 'Додати в кінець', 
        'button_replace'              => 'Замінити', 
        'button_find_duplicates'      => 'Знайти дублі', 
        'button_clear_filters'        => 'Очистити фільтри', 
        'button_add_to_page'          => 'Додати до сторінки', 
        'button_copy'                 => 'Копіювати', 
        'button_delete'               => 'Видалити', 
        'button_move_up'              => 'Вгору', 
        'button_move_down'            => 'Вниз', 
        'button_remove_keyword'       => 'Видалити', 
        'text_search'                 => 'Пошук', 
        'confirm_replace'             => 'Замінити значення на "{{ text }}" у всіх відфільтрованих рядках?', 
        'confirm_add_to_beginning'    => 'Додати "{{ text }}" на початок у всіх відфільтрованих рядках?', 
        'confirm_add_to_end'          => 'Додати "{{ text }}" в кінець у всіх відфільтрованих рядках?', 
        'new_group_placeholder'       => 'Назва нової групи', 
        'button_add_group'            => 'Додати групу', 
      ], 
    ],
    'meta_editor' => [
      'navigation_label'      => 'Редактор метаданих',
      'model_label_singular'  => 'Редактор метаданих',
      'fields' => [
        'formula'       => 'Формула',
        'target_field'  => 'Цільове поле',
        'locale'        => 'Мова',
        'currency_id'   => 'Валюта',
      ],
      'buttons' => [
        'add_formula'                 => 'Додати формулу',
        'add_to_results'              => 'Додати до проміжної таблиці',
        'save_formulas'               => 'Зберегти формули',
        'apply_formula'               => 'Сгенерувати',
        'apply_formula_all'           => 'Згенерувати все',
        'save_staging'                => 'Зберегти зміни',
        'clear_staging'               => 'Очистити зміни',
        'edit'                        => 'Редагувати основний запис',
        'delete'                      => 'Видалити з тимчасової таблиці',
      ],
      'filters' => [
        'incomplete'                  => 'Незаповнені поля',
        'incomplete_all'              => 'Всі',
        'incomplete_true'             => 'Тільки незаповнені',
        'incomplete_false'            => 'Тільки заповнені',
      ],
      'helpers' => [
        'formula_placeholder'         => 'Тіги, що підтримуються: {{name}}, {{manufacturer}}, {{price}}, {{minPrice}}, {{maxPrice}}',
        'results_table_title'         => 'Проміжна таблиця',
        'results_table_descriptions'  => 'Виберіть рядки з таблиці вище, натиснувши кнопку "Додати до проміжної таблиці". Рядки, які відображаються тут, можна редагувати по одній або масово, застосувавши формулу генерації. Рядки зберігаються лише після натискання кнопки "Зберегти". Якщо деякі рядки не вдається згенерувати (наприклад, відсутнє значення токена), вони будуть пропущені під час процесу збереження. Ви можете відредагувати їх вручну, щоб виправити помилки, та зберегти їх пысля цього',
        'formulas_heading'            => 'Формули генерації',
        'formulas_subheading'         => 'Створіть формули тут. Збережіть формули перед їх використанням',
        'formulas_section'            => 'Довідка з формул',
        'formulas_description'        => ' 
          <p class="fi-callout-description">Базове використання: {{token}} у фігурних дужках</p>
          <p class="fi-callout-description">Підтримувані токени:</p>
            <ul class="fi-callout-description">
              <li><b style="user-select: all">{{name}}</b> - назва сутності</li>
              <li><b style="user-select: all">{{parent}}</b> - батьківський елемент сутності, наприклад: батьківська категорія, батьківський виробник тощо.</li>
              <li><b style="user-select: all">{{manufacturer}}</b> - виробник, застосовується тільки для товарів та сторінок фільтрів (якщо сторінка фільтра має виробника)</li>
              <li><b style="user-select: all">{{store}}</b> - назва магазину</li>
              <li><b style="user-select: all">{{price}}</b> - ціна, застосовується тільки для товарів</li>
              <li><b style="user-select: all">{{minPrice}}</b> - мінімальна ціна. Найнижча ціна в категоріях, виробниках та сторінках фільтрів. Найнижча ціна для варіанта товару, якщо товар має варіанти</li>
              <li><b style="user-select: all">{{maxPrice}}</b> - максимальна ціна. Найвища ціна в категоріях, виробниках та сторінках фільтрів. Найвища ціна для варіанта товару, если товар має варіанти</li>
              <li><b style="user-select: all">{{ratingAvg}}</b> - середній рейтинг товару. Для категорій, виробників та сторінок фільтрів розраховується середній рейтинг усіх пов\'язаних товарів</li>
              <li><b style="user-select: all">{{productCount}}</b> - кількість товарів</li>
            </ul>
            <p class="fi-callout-description">До токенів можна застосовувати фільтри через двокрапку: {{token:upper}}, {{token:lower}}, {{token:capitalize}}, {{token:number}}, {{token:currency}}. Приклад: {{store:upper}}, {{parent:lower}}</p>
            <p class="fi-callout-description">Токени можна об\'єднувати в ланцюжки за допомогою вертикальної риски: {{manufacturer|parent|name}}. У цьому випадку буде використано перший ненульовий токен.</p>
            <p class="fi-callout-description">Рядкові заглушки (літерали) можна додавати за допомогою вертикальної риски та тексту в подвійних лапках, якщо токен порожній: {{token|"текст літералу"}}. Текст літералу з\'явиться, якщо всі попередні токени в ланцюжку виявляться порожніми</p>
            <p class="fi-callout-description">Префікси та суфікси можна додавати до токена, зв\'язуючи їх вертикальною рискою: {{minPrice|prefix:" від "|suffix:" та інші пропозиції "}}</p>
            <p class="fi-callout-description">Повні приклади:</p>
            <ul class="fi-callout-description">
              <li>Купити {{name}} та інші {{parent:lower|"високоякісні товари"}} від {{minPrice:currency}} у нашому магазині {{store:upper}}</li>
            </ul>
        ',
      ],
      'messages' => [
        'saved_with_errors'           => 'У деяких рядках були помилки під час генерації, і вони не були збережені. Кількість помилкових рядків -: count. Дивіться помилкові рядки в проміжній таблиці',
        'staging_saved'               => 'Всі рядки збережені! Відмінна робота!',
      ],
    ],
  ],
  'blog' => [
    'authors'  => [
      'navigation_label'      => 'Автори',
      'model_label_singular'  => 'Автор',
      'fields'  => [
        'avatar'          => 'Аватар',
        'name'            => 'Ім\'я',
        'sort_order'      => 'Сортування',
        'is_active'       => 'Активний',
        'created_at'      => 'Дата створення',
        'posts_count'     => 'Кілкість статей',
        'social_links'    => 'Соціальні мережі автора',
        'social_platform' => 'Платформа',
        'social_url'      => 'URL',
      ],
      'buttons' => [
        'add_social_link' => 'Додати соціальну мережу автора'
      ],
      'helpers' => [
        'avatar' => 'відображається в кожному пості і на сторінці автора'
      ],
    ],
    'comments' => [
      'navigation_label'      => 'Відгуки',
      'model_label_singular'  => 'Відгук',
      'fields' => [
        'post'               => 'Стаття',
        'type'               => 'Тип',        
        'author'             => 'Автор',
        'email'              => 'Email',
        'body'               => 'Відгук',
        'rating'             => 'Рейтинг',
        'is_approved'        => 'Ухавлений',
        'created_at'         => 'Дата створення',
        'reply_body'         => 'Відповідь',
        'locale'             => 'Мова',
        'thread'             => 'Відповіді',
        'reply_author'       => 'Автор відповіді',
      ],
      'filters' => [
        'is_approved'        => 'Схвалені коментарі',
        'rating'             => 'Рейтинг',
      ],
      'actions' => [
        'reply'              => 'Відповісти',
      ],
      'notifications' => [
        'reply_sent'         => 'Відповідь додана',
      ],
      'labels' => [
        'admin_reply'        => 'Відповідь админістратора',
        'customer_comment'   => 'Коментар кліента',
        'store_reply_author' => 'Адміністратор',
      ]
    ],
    'tags'  => [
      'navigation_label'      => 'Теги',
      'model_label_singular'  => 'Тег',
      'fields'  => [
        'name'        => 'Назва',
        'sort_order'  => 'Сортування',
        'is_active'   => 'Активний',
        'is_menu'     => 'Відображати в меню',
        'created_at'  => 'Дата створення',
        'posts_count' => 'Статті',
      ],
      'helpers' => [
        'manage_posts_title' => 'Статті в тегу ":name"',
      ],
    ],
    'posts' => [
      'navigation_label'      => 'Статті',
      'model_label_singular'  => 'Стаття',
      'fields'  => [
        'image'       => 'Фото',
        'name'        => 'Назва',
        'sort_order'  => 'Сортування',
        'is_active'   => 'Активна',
        'created_at'  => 'Дата створення',
      ],
      'helpers' => [
        'tags' => 'З якими тегами пов\'язана ця стаття'
      ],
    ]
  ],
  'common' => [
    'fields' => [
      'name'              => 'Назва',
      'slug'              => 'URL',
      'description_short' => 'Короткий опис',
      'description_full'  => 'Повний опис',
      'h1'                => 'H1',
      'meta_title'        => 'Meta title',
      'meta_description'  => 'Meta description',
      'faq_question'      => 'Питання',
      'faq_answer'        => 'Відповідь',
      'how_to_step_name'  => 'Назва крока/етапа',
      'how_to_step_text'  => 'Опис крока/етапа',
      'image'             => 'Зображення',
      'image_description' => 'Опис',
      'footer_tab'        => 'Назва вкладки',
      'footer_content'    => 'Вміст вкладки',
      'created_at'        => 'Дата створення',
      'updated_at'        => 'Дата змінення',
      'is_active'         => 'Активний',
    ],
    'helpers' => [
      'name'                      => 'Ім\'я',
      'slug'                      => 'Має бути унікальним кожною мовою в магазині',
      'description_short'         => 'Вступний текст, який відображається над всіма іншими блоками. рекомендована довжина - до 500 символів',
      'description_full'          => 'Повний опис',
      'h1'                        => 'Додайте основні ключові слова, зробіть схожим на title',
      'meta_title'                => 'Додайте основні ключові слова. Рекомендована довжина - 50-60 символів. Довший заголовок буде обрізаний Google. Максимальна довжина - 160 символів',
      'meta_description'          => 'Рекомендована довжина - 120 символів для мобільних пристроїв та 150 символів для настільних комп\'ютерів. Довший опис буде обрізаний Google. Максимальна довжина - 255 символів',
      'image_description'         => 'Alt атрибут зображення, найкраще до 125 символів',
      'images_tab'                => 'Не забудьте заповнити атрибут Alt для зображення, це допоможе пошуковим системам зрозуміти, что зображено, та, відповідно, покращить SEO-рейтинг',
      'footer_tab'                => 'Тут можна додати контент у вигляді вкладок, в основному для SEO, щоб наповнити сторінку відсутніми ключовими словами',
      'faq_tab'                   => 'FAQ відобразиться під повним описом у вигляді згортаємих блоків Питання/відповідь',
      'how_to_tab'                => 'HowTo відобразиться під повним описом у вигляді кроків і вказань',
      'image_type_not_set_title'  => 'Розміри зображень не задано',
      'image_type_not_set_info'   => 'Відсутні настройки розірів зображень для <b>:type</b>! Встановіть ці розміри в налаштуваннях у розділі Дизайн/Зображення, щоб додати картинки до цієї сторінки',
      'manager_page_title'        => ':entities пов\'язані з :name',
      'manager_page_modal_title'  => 'Прив\'язати :entities до :name',
    ],
    'tabs' => [
      'content'     => 'Контент',
      'description' => 'Опис',
      'faq'         => 'FAQ',
      'how_to'      => 'HowTo',
      'images'      => 'Зображення',
      'footer'      => 'Футер',
      'relations'   => 'Зв\'язки',
      'general'     => 'Основні',
    ],
    'buttons' => [
      'save'              => 'Зберегти',
      'cancel'            => 'Скасувати',
      'edit'              => 'Редагувати',
      'add_faq_row'       => 'Додати нове Питання/Відпвідь',
      'add_image_row'     => 'Додати нове фото',
      'add_how_to_step'   => 'Додати крок/етап HowTo',
      'add_how_to_tool'   => 'Додати інструмент HowTo',
      'add_how_to_supply' => 'Додати необхіну річ для HowTo',
      'add_footer_tab'    => 'Додати вкладку Footer',
      'create_slug'       => 'Створити URL із назви',
      'paste_h1'          => 'Вставити назву в H1',
      'paste_title'       => 'Вставити H1 або назву в Title',
      'paste_description' => 'Вставити Title в початок Description',
      'attach_record'     => 'Прив\'язати',
    ],
  ],
  'design' => [
    'image_settings' => [
      'navigation_label'    => 'Зображення',
      'subheading'          => 'Тут можна змінити логотип магазина і задати глобальні розміри зображень',
      'logo'                => 'Логотип',
      'product'             => 'Товар',
      'category'            => 'Категорія',
      'manufacturer'        => 'Виборник',
      'blog'                => 'Блог',
      'product_miniature'   => 'Товар - мініатюра',
      'product_main'        => 'Товар - основне',
      'options_attributes'  => 'Опції і атрибути',
      'options'             => 'Опції',
      'attributes'          => 'Атрибути',
      'blog_miniature'      => 'Блог - мініатюра',
      'blog_main'           => 'Блог - основне',
      'category_miniature'  => 'Категорія - мініатюра',
      'category_main'       => 'Категорія - основне',
      'slider'              => 'Слайдер',
      'misc'                => 'Інші',
      'image_type'          => 'Тип зображення',
      'width'               => 'Ширина (px)',
      'height'              => 'Висота (px)',
    ],
    'css_editor' => [
      'navigation_label'  => 'Редактор CSS',
      'subheading'        => 'Тут ви можете додати стилі CSS, що перевизначаються, які відповідають основному файлу CSS. Основний файл CSS не змінюється.',
    ],
  ],
  'navigation' => [
    'groups' => [
      'orders'          => 'Замовлення',
      'catalog'         => 'Каталог',
      'blog'            => 'Блог',
      'stock'           => 'Склад',
      'customers'       => 'Клієнти',
      'seo'             => 'SEO',
      'design'          => 'Дизайн',
      'store_settings'  => 'Налаштування магазина',
      'global_settings' => 'Глобальні налаштування',
    ],
  ],

  'store_homepage'  => ['navigation_label' => 'Головна',],

  // Info pages
  'info_pages' => [
    'navigation_label'     => 'Інфо сторінки',
    'model_label_singular' => 'Інфо сторінка',
  ],

  // Store contacts form
  'store_contacts' => [
    'navigation_label' => 'Контакти',
    'fields' => [
      'legal_infos'                => 'Юридична інформація',
      'organization_description'   => 'Опис організації',
      'local_business_description' => 'Опис фізичного магазину',
      'legal_name'                 => 'Юридична назва',
      'address_details'            => 'Адреса',
      'country'                    => 'Країна',
      'region'                     => 'Регіон або код області',
      'city'                       => 'Місто',
      'street'                     => 'Вулиця, номер будинку',
      'iso_code'                   => 'ISO-код країни',
      'postal_code'                => 'Поштовий індекс',
      'geo_infos'                  => 'Географічні координати',
      'latitude'                   => 'Широта',
      'longitude'                  => 'Довгота',
      'email'                      => 'Електронна пошта',
      'open_hours'                 => 'Години роботи',
      'day'                        => 'День тижня',
      'opens'                      => 'Відчиняється',
      'closes'                     => 'Зачиняється',
      'phones'                     => 'Номери телефонів',
      'phone_name'                 => 'Назва телефону (Робочий, Сервіс, Підтримка тощо)',
      'phone_number'               => 'Номер телефону',
      'social_links'               => 'Посилання на соціальні мережі',
      'social_link_icon'           => 'Іконка',
      'social_link_title'          => 'Назва',
      'social_link_link'           => 'Посилання',
      'social_contacts'            => 'Контакти в месенджерах (WhatsApp, Viber тощо)',
      'social_contact_icon'        => 'Іконка',
      'social_contact_title'       => 'Назва',
      'social_contact_link'        => 'Посилання',
    ],
    'helpers' => [
      'legal_name'                 => 'Юридична назва компанії. Використовується в мікророзмітці JSON-LD та на сторінці «Про нас»',
      'organization_description'   => 'Короткий опис вашої компанії у кількох реченнях. Використовується в мікророзмітці JSON-LD та на сторінці «Про нас»',
      'local_business_description' => 'Короткий опис точки продажів (фізичного магазину) у кількох реченнях. Використовується в мікророзмітці JSON-LD та на сторінці «Про нас». Якщо у вас немає офлайн-магазину, це поле можна залишити порожнім',
      'country'                    => 'Назва країни звичайною мовою. Використовується на сторінці «Про нас» та в мікророзмітці JSON-LD для відображення розширених результатів пошуку Google',
      'region'                     => 'Назва регіону звичайною мовою. Використовується на сторінці «Про нас» та в мікророзмітці JSON-LD для відображення розширених результатів пошуку Google',
      'city'                       => 'Назва міста звичайною мовою. Використовується на сторінці «Про нас» та в мікророзмітці JSON-LD для відображення розширених результатів пошуку Google',
      'street'                     => 'Назва вулиці та номер будинку звичайною мовою. Використовується на сторінці «Про нас» та в мікророзмітці JSON-LD для відображення розширених результатів пошуку Google',
      'iso_code'                   => 'Дволітерний ISO-код країни у форматі ISO 3166-1 alpha-2: UA, PL, US, GB тощо. Використовується на сторінці «Про нас» та в мікророзмітці JSON-LD',
      'postal_code'                => 'Поштовий індекс за адресою реєстрації або розташування компанії. Підвищує довіру пошукових систем до інформації про компанію',
      'latitude'                   => 'Формат: 50.450100 (десяткові градуси). Допомагає Google Maps визначити розташування вашого магазину. Якщо у вас немає точки продажів (фізичного магазину), це поле можна залишити порожнім',
      'longitude'                  => 'Формат: 30.523400 (десяткові градуси). Допомагає Google Maps визначити розташування вашого магазину. Якщо у вас немає точки продажів (фізичного магазину), це поле можна залишити порожнім',
      'open_hours'                 => 'Приклад дня тижня: <u><b>Monday</b></u> - завжди англійською,<br>приклад часу роботи: <u><b>10:30</b></u>',
      'social_contacts'            => 'Посилання на месенджери: Viber, Facebook messenger, WhatsApp, тощо. Іконки можна додати в форматі SVG, назва - просто заголовок<br><b>Приклади посилань:</b>
        <ul class="fi-sc-unordered-list">
          <li><u><b>Viber:</b></u> viber://contact?number=%2B{НомерТелефонаБезЗнакаПлюс}</li>
          <li><u><b>WhatsApp:</b></u> https://wa.me/{НомерТелефонаБезЗнакаПлюс}</li>
          <li><u><b>Telegram:</b></u> https://t.me/{ВашАкаунтТелеграм}</li>
          <li><u><b>Facebook Messenger:</b></u> https://m.me/{ВашАкаунтФейсбук}</li>
        </ul>
      ',
    ],
    'buttons' => [
      'add_open_hours'     => 'Додати час роботи',
      'add_phone'          => 'Додати номер телефона',
      'add_social_link'    => 'Додати соціальне посилання',
      'add_social_contact' => 'Додати соціальний контакт',
    ],
  ],

  // Store settings
  'store_settings' => [
    'navigation_label' => 'Налаштування',
    'tabs' => [
      'delivery_settings'       => 'Доставка',
      'checkout_settings'       => 'Замовлення',
      'legal_settings'          => 'Правові налаштування',
      'tax_settings'            => 'Податки',
      'analytics_settings'      => 'Аналітка',
      'seo_defaults'            => 'SEO за замовченням',
      'notification_settings'   => 'Повідомлення',
      'maintenance_settings'    => 'Режим обслуговування',
    ],
    'delivery_settings' => [
      'fields' => [
        'transit_min'   => 'Мінімальний час доставки (дні)',
        'transit_max'   => 'Максимальний час доставки (дні)',
        'handling_min'  => 'Мінімальний час обробки (дні)',
        'handling_max'  => 'Максимальний час обробки (дні)',
        'return_cost'   => 'Вартість повернення',
      ],
      'helpers' => [
        'transit'     => 'Це значення використовується в розмітці JSON-LD для відображення розширених сніпетів Google і лише як резервне значення. Фактичний час доставки може відрізнятися',
        'handling'    => 'Це значення використовується в розмітці JSON-LD для відображення розширених сніпетів Google і лише як резервне значення. Фактичний час обробки може відрізнятися',
        'return_cost' => 'Це значення використовується в розмітці JSON-LD для відображення розширених сніпетів Google і лише як резервне значення',
      ]
    ],
    'checkout_settings' => [
      'fields' => [
        'minimal_order_total'     => 'Мінімальна сума замовлення',
        'agreement_pages'         => 'Сторінки згоди',
        'service_agreement_page'  => 'Угода користування',
        'return_rules_page'       => 'Правила повернення',
        'checkout_custom_fields'  => 'Додаткові поля',
        'checkout_address_fields' => 'Поля адреси',
        'firstname'               => 'Ім\'я',
        'lastname'                => 'Прізвище',
        'building'                => 'Будинок',
        'apartment'               => 'Квартира',
        'postal_code'             => 'Поштовий індекс',
        'region'                  => 'Регіон',
        'phone'                   => 'Телефон',
        'payer'                   => 'Платник',
        'country'                 => 'Країна',
        'city'                    => 'Місто',
        'street'                  => 'Вулиця',
        'vat_number'              => 'Номер ІПН',
        'company'                 => 'Компанія',
        'time'                    => 'Вибір часу',
        'date'                    => 'Вибір дати',
        'datetime'                => 'Вибір дати та часу',
        'text'                    => 'Текст',
        'textarea'                => 'Текстове поле (textarea)',
        'checkbox'                => 'Чекбокс',
        'add_field'               => 'Додати поле',
        'field_type'              => 'Тип поля',
        'field_name'              => 'Назва поля',
        'is_required'             => 'Обов\'язкове',
      ],
      'helpers' => [
        'checkout_fields' => 'Поля оформлення замовлення, такі як адреса та ім\'я одержувача, які будуть відображатися в кошику',
        'custom_fields'   => 'Додаткові поля оформлення замовлення, такі як бажана дата доставки',
        'service_agreement_page' => 'Буде відображатися як прапорець «Я прочитав(-ла) і погоджуюся з Угодою про надання послуг» на сторінці оформлення замовлення. Пропустіть це, якщо вам це не потрібно',
        'return_rules_page' => 'Буде відображатися як прапорець «Я прочитав(-ла) і погоджуюся з Правилами повернення» на сторінці оформлення замовлення. Пропустіть це, якщо вам це не потрібно',
      ],
    ],
  ],

  // Stores
  'stores' => [
    'navigation_label'      => 'Магазини',
    'model_label_singular'  => 'Магазин',
    'fields' => [
      'name'                => 'Назва',
      'host'                => 'Домен',
      'languages'           => 'Мови',
      'currencies'          => 'Валюти',
      'countries'           => 'Країни',
      'is_active'           => 'Активний',
      'add_language'        => 'Додати мову магазину',
      'add_currency'        => 'Додати валюту магазину',
      'add_country'         => 'Додати країну магазину',
    ],
    'relations' => [
      'languages' => [
        'is_default' => 'Основна мова',
        'is_active'  => 'Активний',
      ],
    ],
    'helpers' => [
      'name'              => 'Назва магазина, тільки для адмінки',
      'host'              => 'Доменне ім\'я магазина без http:// або https://. <br> Приклад: <u><b>store.com</b></u>',
      'host_placeholder'  => 'store.com'
    ],
  ],

  // Users
  'users' => [
    'navigation_label' => 'Користувачі',
    'model_label_singular' => 'Користувач',
    'fields' => [
      'name'        => 'Ім\'я',
      'email'       => 'Email',
      'role'        => 'Тип',
      'password'    => 'Пароль',
      'locale'      => 'Мова інтерфейса',
      'created_at'  => 'Дата створення',
      'is_active'   => 'Активний',
    ],
  ],

  'global' => [
    // Currencies
    'currencies' => [
      'navigation_label'      => 'Валюти',
      'model_label_singular'  => 'Валюта',
      'fields' => [
        'name'          => 'Назва',
        'iso_code'      => 'Код ISO',
        'sign'          => 'Знак валюти',
        'rate'          => 'Курс',
        'rate_default'  => 'Основна',
        'is_active'     => 'Активна',
      ],
      'helpers' => [
        'name'          => 'Назва валюти в панелі адміністратора',
        'iso_code'      => 'Код ISO використовується в розмітці JSON-LD',
        'sign'          => 'Знак використовується для відображення цін у фронтенді та бекенді',
        'rate'          => 'Обмінний курс до вашої валюти за замовчуванням',
        'rate_default'  => 'Ця валюта використовується для розрахунку курсів інших валют. Ця настройка задається глобально для всіх магазинів - тільки для розрахунку курсів',
      ],
    ],

    // Languages
    'languages' => [
      'navigation_label'      => 'Мови',
      'model_label_singular'  => 'Мова',
      'fields' => [
        'flag'                      => 'Прапорець',
        'name'                      => 'Назва',
        'iso_code'                  => 'Код ISO',
        'locale'                    => 'Локаль',
        'is_active'                 => 'Активна',
        'stores'                    => 'Магазини',
        'default_currency'          => 'Валюта',
        'fulltext_search_language'  => 'Словник PostgreSQL',
        'is_default'                => 'Основна мова'
      ],
      'helpers' => [
        'name'                      => 'Назва мови в панелі адміністратора',
        'iso_code'                  => 'Приклад: <b>en-US</b>. Код ISO використовується в розмітці JSON-LD',
        'locale'                    => 'Дволітерне позначення мови відповідно до стандарта ISO. Наприклад: en, uk, pl. Локаль використовується в заголовку HTML, щоб вказати пошуковим системам мову сторінки',
        'default_currency'          => 'Валюта за замовчуванням визначена для відображення цін залежно від мови, щоб пошукові системи бачили правильні ціни залежно від мови. Це не впливає на клієнтів, вони все ще можуть змінювати відображену валюту',
        'fulltext_search_language'  => 'Морфологічний словник повнотекстового пошуку. Ви можете використовувати власний словник для PostgreSQL, але спочатку його потрібно буде встановити'
      ],
    ],
    
    // Countries
    'countries' => [
      'navigation_label'      => 'Країни',
      'model_label_singular'  => 'Країна',
      'fields' => [
        'name'                  => 'Назва',
        'localization_settings' => 'Настройки локалізації',
        'iso_code'              => 'ISO код',
        'phone_code'            => 'Код телефона',
        'default_currency_id'   => 'Основна валюта',
        'is_eu_member'          => 'Входить в ЕС',
        'regions'               => 'Області',
        'region'                => 'Область',
        'add_region'            => 'Додати область',
        'is_active'             => 'Активна',
      ],
      'helpers' => [
        'add_region'  => 'Необов\'язково, ви можете пропустити це',
        'iso_code'    => 'ISO-код країни у дволітерному форматі ISO 3166-1 alpha-2: UA, PL, US, GB тощо. ISO-код використовується в мікроданих JSON-LD для відображення розширених сніпетів Google',
        'phone_code'  => 'Телефонний код країни: +380, +48, ​​+1, +44 для форматування телефонів під час оформлення замовлення',
      ],
    ],

    // Store wizard
    'store_wizard' => [
      'navigation_label' => 'Майстер налаштування',
      'fields' => [
        'existing_currency' => 'Використовувати існуючу валюту',
        'new_currency'      => 'Створити валюту',
        'existing_language' => 'Використовувати існуючу мову',
        'new_language'      => 'Створити мову',
        'existing_country'  => 'Використовувати існуючу країну',
        'new_country'       => 'Створити країну',
      ],
      'messages' => [
        'currency_language_hint' => 'Валютою за замовчуванням для цієї мови буде встановлено :currency з попереднього кроку. Ви завжди можете змінити це налаштування в панелі адміністратора у розділі «Глобальні налаштування/Мови»',
        'currency_country_hint'  => 'Валютою за замовчуванням для цієї країни буде встановлено :currency з попереднього кроку. Ви завжди можете змінити це налаштування в панелі адміністратора у розділі «Глобальні налаштування/Країни»',
      ],
      'steps' => [
        'currency'  => 'Валюта',
        'language'  => 'Мова',
        'country'   => 'Країна',
        'store'     => 'Магазин',
      ],
      'actions' => [
        'create' => 'Створити магазин'
      ]
    ]
  ],
];