<?php 
return [
  // Common
  'messages' => [
    'settings_saved'            => 'Налаштування збережені',
    'contacts_saved'            => 'Контакти збережені',
    'homepage_saved'            => 'Головна сторінка збережена',
    'file_saved'                => 'Файл збережено',
    'error_saving_file'         => 'Помилка при збереженні файлу',
    'delete_restricted_title'   => 'Увага! Ви не можете це видалити через інші залежні дані!',
    'delete_cascade_warning'    => 'Увага! Якщо ви видалите цеб інші залежні дані також будуть видалені!',
    'ai_provider_error'         => 'Помилка сервіса AI!',
    'ai_fill_required_fields'   => 'Заповніть обов\'язкові поля перед відправкою промпта',
  ],
'orders' => [
    'statuses' => [
      'navigation_label'      => 'Статуси',
      'model_label_singular'  => 'Статус',
      'fields' => [
        'name'            => 'Назва статусу',
        'color'           => 'Колір статусу',
        'icon'            => 'Іконка',
        'notification'    => 'Сповістити клієнта',
        'is_default'      => 'За замовчуванням',
        'is_paid'         => 'Сплачений',
        'is_shipped'      => 'Доставлено',
        'is_finished'     => 'Завершено',
        'is_active'       => 'Активний',
      ],
    ],
  ],
  'catalog' => [
    'products' => [
      'navigation_label'      => 'Товари',
      'model_label_singular'  => 'Товар',
      'table' => [
        'columns' => [
          'global_name'             => 'Глобальна назва',
          'sku'                     => 'Арт',
          'price'                   => 'Ціна',
          'created_at'              => 'Створено',
          'updated_at'              => 'Змінено',
          'valid_until'             => 'до',
          'store_name'              => 'Назва в магазині',
          'is_active'               => 'Активний у цьому магазині',
          'is_not_active'           => 'Неактивний у цьому магазині',
          'is_not_associated'       => 'Не зв\'язаний з цим магазином',
        ],
        'filters' => [
          'is_active'      => 'Активний',
          'is_available'   => 'Доступний для замовлення',
          'categories'     => 'Категорії',
          'manufacturers'  => 'Виробники',
          'tags'           => 'Теги',
          'options'        => 'Опції',
        ],
        'buttons' => [
          'delete_from_store'       => 'Видалити товар із поточного магазину',
          'delete_from_all_stores'  => 'Видалити товар з усіх магазинів',
          'edit_product'            => 'Редагувати товар',
        ],
        'messages' => [
          'empty_state_message'     => 'Товари можуть бути прив’язані до кількох магазинів одночасно, маючи при цьому різні ціни, описи, набори опцій та атрибутів, а також можуть відображатися в різних категоріях усередині кожного магазину',
          'delete_from_store'       => 'Ця дія видалить товар із поточного магазину, але збереже його в інших магазинах. Усі дані товару в поточному магазині будуть видалені. Продовжити?',
          'delete_from_all_stores'  => 'Ця дія видалить товар з усіх магазинів. Усі дані товару в усіх магазинах будуть видалені. Ця дія є незворотною. Продовжити?',
        ],
      ],
      'tabs' => [
        'content' => [
          'labels' => [
            'global_name'   => 'Глобальна назва',
            'is_active'     => 'Активний у цьому магазині',
            'is_available'  => 'Доступний для замовлення в цьому магазині',
          ],
          'helpers' => [
            'global_name'   => 'Відображається лише в панелі адміністратора. Використовується для швидкого пошуку товару',
            'is_active'     => 'Чи івдображаеться товар в каталозі цього магазина. Статус товару налаштовується окремо для кожного магазину',
            'is_available'  => 'Чи можна замовити товар в цьому магазині. Доступність товару для замовлення налаштовується окремо для кожного магазину',
          ],
        ],
        'placement' => [
          'label'   => 'Розміщення',
          'labels'  => [
            'categories'              => 'Категорії для відображення',
            'category'                => 'Категорія',
            'is_primary_category'     => 'Основна категорія',
            'manufacturer'            => 'Виробник',
            'manufacturers'           => 'Виробники',
            'is_primary_manufacturer' => 'Основний виробник',
            'product_tags'            => 'Теги товару',
            'tag'                     => 'Тег',
            'sort_order'              => 'Сортування'
          ],
          'helpers' => [
            'categories'    => 'Виберіть категорії, в яких відображатиметься товар. Основна категорія використовується для формування URL-адреси товару',
            'manufacturers' => 'Виберіть виробників, у яких відображатиметься товар. Основний виробник використовується для виведення логотипа та посилання на сторінку бренду на картці товару',
            'tags'          => 'Теги товару — це додатковий спосіб групування для виведення на сторінках SEO-фільтрів. Вони також можуть відображатися у вигляді бейджів на мініатюрі та головному зображенні товару',
          ],
          'buttons' => [
            'add_tag'                 => 'Додати тег товару',
            'add_category'            => 'Додати категорію',
            'add_manufacturer'        => 'Додати виробника',
          ],
          'errors' => [
            'no_primary_category' => 'Виберіть хоча б одну категорію та вкажіть основну категорію',
            'no_categories'       => 'Створіть категорії, щоб додати до них товар',
          ]
        ],
        'prices' => [
          'label' => 'Ціни',
          'labels' => [
            'price_tiers'       => 'Групи цін',
            'base_price'        => 'Базова ціна',
            'price_terms'       => 'Умови цін',
            'price_values'      => 'Значення цін',
            'price_input'       => 'Ціна в :currency',
            'price_name'        => 'Назва ціни',
            'valid_from'        => 'Група цін діє з дати',
            'valid_until'       => 'Група цін діє по дату',
            'customer_group'    => 'Група клієнтів',
            'no_group'          => 'Усі клієнти',
            'is_base'           => 'Базова ціна',
            'discount_amount'   => 'Сума знижки',
            'discount_percent'  => 'Відсоток знижки',
            'priority'          => 'Пріоритет ціни',
            'valid_quantity'    => 'Мінімальна кількість для застосування ціни, шт',
            'valid_dates'       => 'Дати дії групи цін',
            'primary_currency'  => 'Основна валюта цього магазину',
            'pcs'               => 'шт',
            'priority_placeholder' => 'Більша цифра = більше пріоритет',
          ],
          'helpers' => [
            'price_tiers'       => 'Кожна група цін містить ціни всіх варіантів товару в усіх валютах. У товару завжди повинна бути базова група цін — тобто ціни без знижок та умов. Щоб додати скидки, створіть додатковий рівень цін',
            'price_name'        => 'Відображається у вигляді бейджа поруч із ціною. Залиште порожнім, якщо це не потрібно',
            'valid_quantity'    => 'Мінімальна кількість товару в кошику для застосування цієї ціни',
            'priority'          => 'Якщо кілька цін мають схожі умови застосування, буде використано ціну з вищим пріоритетом',
            'customer_group'    => 'Виберіть групу клієнтів, для якої діятиме ця ціна, або залиште поле порожнім, щоб застосувати цю групу цін до всіх клієнтів',
            'valid_dates'       => 'Виберіть дати, протягом яких діятиме ця група цін',
          ],
          'buttons' => [
            'add_price_tier'        => 'Додати групу цін',
            'exchange_rate'         => 'Розрахувати за курсом обміну',
            'fill_all_combinations' => 'Заповнити всі комбінації цією ціною',
          ],
          'item_label' => [
            'is_base'           => 'Базова ціна',
            'is_discount'       => 'Знижка',
            'valid_from'        => 'від',
            'valid_until'       => 'до',
            'dates_valid'       => 'дати дії',
            'from_qty'          => 'від :qty шт.'
          ],
          'errors' => [
            'exactly_one_base' => 'У товара має бути базова ціна'
          ]
        ],
        'options' => [
          'label' => 'Опції',
          'labels' => [
            'options'           => 'Групи опцій',
            'option_vals'       => 'Варіанти опцій',
            'variants_selector' => 'Доступні варіанти товару',
            'descriptions'      => 'Описи опцій',
            'group_name'        => 'Назва опції',
            'option_val_name'   => 'Назва варіанта опції',
            'description'       => 'Опис варіанта опції',
          ],
          'helpers' => [
            'options'           => 'Виберіть пов’язані з цим товаром опції. Спочатку виберіть групи опцій та варіанти опцій, потім позначте прапорцями комбіновані варіанти, які існують для цього товару',
            'variants_selector' => 'Позначте комбіновані варіанти опцій, які будуть застосовані до цього товару. Не забудьте заповнити ціну для кожного варіанта на вкладці цін',
            'descriptions'      => 'Ви можете призначити унікальний опис для кожного варіанта опції - саме так він відображатиметься на сторінці товару. Назви та описи заповнені значеннями за замовчуванням, тому вам не потрібно заповнювати все, якщо унікальні назви та описи не потрібні',
            'group_name'        => 'Назва групи відображатиметься на сторінці товару в блоці вибору опцій та в таблиці характеристик. Це впливає лише на відображення опції на сторінці товару і ні на що більше',
            'description'       => 'Опис опції відображається в таблиці характеристик товару. За потреби ви можете додати сюди унікальний опис',
          ],
          'placeholders' => [
            'no_options'            => 'Опції не знайдено',
            'search_options'        => 'Шукати групи опцій',
            'searching_options'     => 'Пошук груп опцій...',
            'no_option_vals'        => 'Варіанти опцій не знайдено',
            'search_option_vals'    => 'Шукати варіанти опцій',
            'searching_option_vals' => 'Пошук варіантів опцій...',
            'variants_search'       => 'Шукати варіанти комбінацій',
            'no_variants'           => 'Варіанти не знайдено',
          ],
        ],
        'attributes' => [
          'label' => 'Атрибути',
          'labels' => [
            'attribute'       => 'Група атрибутів',
            'attribute_value' => 'Значення атрибута',
          ],
          'placeholders' => [
            'no_attributes'               => 'Атрибути не знайдено',
            'search_attributes'           => 'Шукати атрибути',
            'searching_attributes'        => 'Пошук атрибутів...',
            'no_attribute_values'         => 'Значення атрибутів не знайдено',
            'search_attribute_values'     => 'Шукати значення атрибутів',
            'searching_attribute_values'  => 'Пошук значень атрибутів...',
          ],
          'helpers' => [
            'label' => 'Атрибути — це незмінні характеристики товару. За ними можна фільтрувати товари у блоці фільтрів. Атрибути відображаються в таблиці характеристик на сторінці товару'
          ],
          'buttons' => [
            'add_attribute'       => 'Додати атрибут',
            'add_attribute_value' => 'Додати значення атрибута',
          ],
        ],
        'delivery'  => [
          'label' => 'Доставка'
        ],
        'inventory' => [
          'label' => 'Склад'
        ],
        'reviews' => [
          'label' => 'Відгуки',
        ],
        'statistics' => [
          'label' => 'Статистика'
        ],
      ],
    ],
    'categories' => [
      'navigation_label'      => 'Категорії',
      'model_label_singular'  => 'Категорія',
      'fields' => [
        'is_active'       => 'Активна',
        'is_root'         => 'Коренева',
        'show_in_facets'  => 'Відображати у фільтрі',
        'parent_id'       => 'Батьківська категорія',
      ],
      'helpers' => [
        'parent_id'       => 'Виберіть батьківську категорію або залиште порожнім, щоб зробити цю категорію кореневою',
        'group_title'     => 'Категорії – це основний спосіб груповання товарів. Кожен товар може відображатися в кількох категоріях',
      ],
    ],
    'manufacturers' => [
      'navigation_label'      => 'Виробники',
      'model_label_singular'  => 'Виробник',
      'fields'  => [
        'is_active'       => 'Активний',
        'is_root'         => 'Кореневий',
        'show_in_facets'  => 'Відображати у фільтрі',
        'parent_id'       => 'Батьківський виробник',
      ],
      'helpers' => [
        'parent_id'       => 'Виберіть батьківського виробника або залиште порожнім, щоб зробити цього виробника кореневим',
        'group_title'     => 'Виробники товару відображаються на сторінці товару у вигляді логотипу та посилання, та у фільтрі товарів. У товару може бути кілька пов\'язаних виробників, але тільки основний буде відображено на сторінці товару',
      ],
    ],
    'attributes' => [
      'navigation_label'        => 'Атрибути',
      'model_label_singular'    => 'Атрибут',
      'fields'  => [
        'group_title'           => 'Атрибут',
        'group'                 => 'Група',
        'group_name'            => 'Назва групи атрибутів',
        'values'                => 'Значення атрибутів',
        'image'                 => 'Картинка',
        'description'           => 'Опис атрибута',
        'attribute_name'        => 'Назва атрибута',
        'slug'                  => 'URL',
        'show_in_facets'        => 'Відображати в фильтрі',
        'is_active'             => 'Активний',
      ],
      'helpers' => [
        'title_helper'          => 'Атрибути - це незмінні властивості товару. Відображаються на сторінці товару у вигляді таблиці і в фільтрі товарів',
        'group_name'            => 'Назва групи буде відображатись у фільтрі як батьківський елемент для значень атрибутів',
        'is_active'             => 'Показувати цю групу атрибутів на сторінці товару та у фільтрі',
        'show_in_facets'        => 'Показувати цю групу атрибутів у фільтрі',
        'value_is_active'       => 'Показувати це значення атрибуту на сторінці товару та у фільтрі',
        'value_show_in_facets'  => 'Показувати це значення атрибуту у фільтрі',
        'description'           => 'Цей опис буде відображатися на сторінці товару. Його можна змінити індивідуально для кожного товару в налаштуваннях товару'
      ],
      'buttons' => [
        'add_attribute_value' => 'Додати значення атрибута'
      ]
    ],
    'options' => [
      'navigation_label'      => 'Опції',
      'model_label_singular'  => 'Опція',
      'fields'  => [
        'group_title'           => 'Опція',
        'group'                 => 'Група',
        'group_name'            => 'Назва групи опцій',
        'values'                => 'Варіанти опцій',
        'image'                 => 'Зображення',
        'description'           => 'Опис',
        'option_name'           => 'Назва опції',
        'slug'                  => 'URL',
        'show_in_facets'        => 'Відображати у фільтрі',
        'is_active'             => 'Активна',
        'is_default'            => 'Вибрана за замовчуванням',
        'type'                  => 'Тип опції',
        'radio'                 => 'Перемикач',
        'checkbox'              => 'Чекбокс',
      ],
      'helpers' => [
        'group_title'           => 'Опції - це змінні властивості товару. Вони впливають на ціну товару, артикул, наявність і вагу. Тут ви можете додати список доступних опцій. Щоб прив\'язати їх до товару, перейдіть на сторінку налаштувань товару',
        'group_name'            => 'Назва групи відображатиметься у фасетному фільтрі як батьківський елемент значень опцій',
        'is_active'             => 'Показувати цю групу на сторінці товару та в блоці фільтрів',
        'show_in_facets'        => 'Показувати цю групу в блоці фільтрів',
        'value_is_active'       => 'Показувати цей варіант опції на сторінках товару',
        'value_show_in_facets'  => 'Показувати цей варіант опції в блоці фільтрів',
        'is_default'            => 'Встановити цей варіант вибраним за замовчуванням. Може бути перевизначеним в налаштуваннях товару',
        'type'                  => 'Тип опції визначає спосіб її вибору: одна зі списку (перемикач) або кілька (чекбокс)',
      ],
      'buttons' => [
        'add_attribute_value' => 'Додати значення опції'
      ]
    ],
    'tags' => [
      'navigation_label'      => 'Теги',
      'model_label_singular'  => 'Тег',
      'fields' => [
        'show_in_facets'  => 'Відображати у фільтрі',
        'is_active'       => 'Активний',
        'inline_style'    => 'Вбудований CSS стиль',
      ],
      'helpers' => [
        'is_active'       => 'Показувати цей тег на сторінці товару та у фільтрі',
        'show_in_facets'  => 'Показувати цей тег у фільтрі',
        'inline_style'    => 'Вбудований стиль буде застосований до тега на сторінках товарів та в мініатюрах',
        'group_title'     => 'Теги потрібні для угруповання товарів, коли потрібно об\'єднати товари в групу і створити для них посадкову сторінку. Теги також відображаются в фільтрі товарів',
      ],
    ],
    'facet_pages' => [
      'navigation_label'      => 'Сторінки фільтра',
      'model_label_singular'  => 'Сторінка фільтра',
      'fields' => [
        'is_active'         => 'Активна',
        'facet_list'        => 'Список фільтрів',
        'facet_index'       => 'Список фільтрів',
        'root_facet'        => 'Основний фільтр',
        'additional_facets' => 'Додаткові фільтри'
      ],
      'buttons' => [
        'add_facet'   => 'Додати фільтр'
      ],
      'errors' => [
        'duplicate_combination'   => 'Така комбинація фильтрів вже існує',
        'root_facet_not_selected' => 'Виберіть одну категирію або одного виробника для цієї Сторінки фільтра',
        'facet_type_required'     => 'Виберіть тип фільтра',
        'facet_value_required'    => 'Виберіть значення фільтра',
      ],
      'helpers' => [
        'root_facet'        => 'Основний фільтр визначає, який фільтр буде основним та обов\'язковим для цієї сторінки фільтрів',
        'additional_facets' => 'Додаткові фільтри визначають комбінацію інших фільтрів разом із основним фільтром для даної сторінки фільтрації',
        'group_title'       => 'Сторінки фільтра – це посадкові сторінки для більш точного охоплення SEO запитів. Сторінка фільтра дозволяє вибрати комбінацію з основного фільтра (категорії або виробник) та одного або кількох додаткових фільтрів (опції, атрибути, теги) та створити для цієї комбінації сторінку з усіма атрибутами статичної сторінки: Title, докладний опис',
      ]
    ],
    'facets' => [
      'types' => [
        'category'      => 'Категорія',
        'manufacturer'  => 'Виробник',
        'attribute'     => 'Атрибут',
        'option'        => 'Опція',
        'tag'           => 'Тег',
        'is_featured'   => 'Рекомендований',
        'has_discount'  => 'Зі знижкой',
        'bestseller'    => 'Лідер продажів',
        'best_reviews'  => 'Кращі відгуки',
      ]
    ],
    'product_reviews' => [
      'navigation_label'      => 'Відгуки про товари',
      'model_label_singular'  => 'Відгук про товар',
      'fields' => [
        'product'            => 'Товар',
        'type'               => 'Тип',        
        'author'             => 'Автор',
        'email'              => 'Email',
        'body'               => 'Текст відгуку',
        'rating'             => 'Рейтинг',
        'is_approved'        => 'Схвалено',
        'created_at'         => 'Дата створення',
        'reply_body'         => 'Відповідь',
        'locale'             => 'Мова',
        'thread'             => 'Гілка відповідей',
        'reply_author'       => 'Автор відповіді магазину',
        'positive_notes'     => 'Переваги',
        'negative_notes'     => 'Недоліки',
      ],
      'filters' => [
        'is_approved'        => 'Схвалено',
        'rating'             => 'Рейтинг',
        'no_reply'           => 'Без відповіді',
      ],
      'actions' => [
        'reply'              => 'Відповісти',
      ],
      'notifications' => [
        'reply_sent'         => 'Відповідь успішно відправлена',
      ],
      'buttons' => [
        'add_positive' => 'Додати перевагу',
        'add_negative' => 'Додати недолік',
      ],
      'labels' => [
        'admin_reply'        => 'Відповідь адміністратора',
        'customer_review'    => 'Відгук клієнта',
        'store_reply_author' => 'Автор відповіді магазину',
      ],
      'helpers' => [
        'group_title' => 'Тут ви можете переглянути відгуки про товари, відредагувати їх або написати відповідь на відгук'
      ]
    ],
  ],
  'customers' => [
    'customer' => [
      'navigation_label'      => 'Покупці',
      'model_label_singular'  => 'Покупець',
      'fields' => [
        'customer'               => 'Покупець',
        'is_approved'            => 'Схвалений',
        'customer_group_id'      => 'Група',
        'email'                  => 'Email',
        'first_name'             => 'Ім\'я',
        'last_name'              => 'Прізвище',
        'phone'                  => 'Телефон',
        'addresses'              => 'Адреси покупця',
        'addresses_label'        => 'Назва адреси',
        'addresses_placeholder'  => 'Наприклад: Дім, Робота',
        'is_default_shipping'    => 'Адреса доставки за замовченням',
        'is_default_billing'     => 'Адреса оплати за замовченням',
        'add_address'            => 'Додати адресу',
        'locale'                 => 'Бажана мова покупця',
        'password'               => 'Пароль',
        'marketing_opt_in'       => 'Згода на маркетинг',
        'gdpr_consent_at'        => 'Згода GDPR',
        'date_anonymized_at'     => 'Дата анонімізації',
        'deleted_at'             => 'Дата видалення',
        'created_at'             => 'Дата реєстрації',
        'updated_at'             => 'Дата зміни',
        'presonal_data'          => 'Персональні дані',
        'store_data'             => 'Дані магазину',
        'email_data'             => 'Email',
        'email_verified_at'      => 'Дата верифікації Email',
        'company_data'           => 'Компанія',
        'company_name'           => 'Назва компанії',
        'vat_number'             => 'Номер ІПН/ЕДРПОУ',
        'privacy_data'           => 'Конфіденційність',
        'anonymize'              => 'Анонімізувати дані'
      ],
      'messages' => [
        'anonymize_title'       => 'Анонімізувати дані користувача?',
        'anonymize_description' => 'Ця дія є незворотною. Усі персональні дані користувача будуть замінені на фіктивні заглушки',
        'anonymize_confirm'     => 'Я розумію, продовжити',
      ]
    ],
    'customer_groups' => [
      'navigation_label'      => 'Групи покупців',
      'model_label_singular'  => 'Група покупців',
      'fields' => [
        'name'                   => 'Назва',
        'code'                   => 'Тип',
        'price_modifier_percent' => 'Модифікатор ціни',
        'free_shipping'          => 'Безкоштовна доставка',
        'show_prices'            => 'Показувати ціни',
        'requires_approval'      => 'Потребує схвалення',
        'tax_exempt'             => 'Показувати податки',
        'is_default'             => 'За замовчуванням для нових користувачів',
        'sort_order'             => 'Порядок сортування',
        'is_active'              => 'Активна',
        'group_settings'         => 'Налаштування групи',
        'all_groups'             => 'Всі групи',
      ],
      'helpers' => [
        'price_modifier_percent' => 'Тут можна вказати позитивне або негативне значення, яке буде застосовано до всіх цін у вашому магазині',
        'code'                   => 'Загальний тип групи покупців, наприклад: нові, постійні, B2B тощо'
      ]
    ]
  ],
  'seo' => [
    'slugs' => [
      'model_label_singular'  => 'URL',
      'navigation_label'      => 'URLs',
      'fields' => [
        'url'                   => 'URL',
        'language'              => 'Мова',
        'type'                  => 'Тип',
        'id'                    => 'ID',
        'redirect'              => 'Редирект 301',
        'sluggable_id'          => 'ID сторінки',
        'robots'                => 'Тег robots',
        'index_follow'          => 'Index, Follow',
        'noindex_follow'        => 'Noindex, Follow',
        'index_nofollow'        => 'Index, Nofollow',
        'noindex_nofollow'      => 'Noindex, Nofollow',
      ],
      'helpers' => [
        'redirect'  => 'Переадресовувати запит з кодом 301 з поточного URL на цей',
        'is_active' => 'Якщо URL не активний, то і поточний URL, і Редирект буде віддавати код 410',
        'type'      => 'Тип сторінки, наприклад BlogPost, Product, ProductOption Category, Manufacturer і тощо',
        'id'        => 'ID сторінки щоб контролер знав яку саме сторінку відкривати',
        'robots'    => 'Тег robots потрібен для того, щоб вказувати пошуковим роботам, як цю сторінку потрібно додавати в пошуковий індекс',
      ],
      'errors' => [
        'slug_taken'              => 'Цей URL вже використовується',
        'alpha_dash'              => 'Дозволені тільки латинські літери, цифри і тире замість пробілів',
        'slug_duplicate_in_form'  => 'В цій формі дублюється URL', 
      ]
    ],
    'robots_editor' => [
      'navigation_label' => 'Robots.txt',
      'fields' => [
        'edit_robots_file'        => 'Редагувати robots.txt',
        'robots_file_description' => 'Кожен магазин має окремий файл robots.txt, вони не заважають один одному',
      ],
      'messages' => [
        'file_saved'        => 'Файл Robots.txt успішно збережено',
        'error_saving_file' => 'Помилка під час збереження файлу Robots.txt. Можливо, вам потрібно створити symlink або встановити CHMOD на папку зберігання',
      ],
    ],
    'keywords' => [ 
      'navigation_label' => 'Ключові слова', 
      'model_label_singular' => 'Ключове слово', 
      'js' => [ 
        'column_seo_keyword'          => 'Ключове слово', 
        'column_url'                  => 'URL', 
        'column_language'             => 'Мова', 
        'column_group'                => 'Група', 
        'column_add_keyword'          => 'Додати', 
        'column_edit_keyword'         => 'Редагувати', 
        'option_all_types'            => 'Всі типи', 
        'option_existing'             => 'Існуюче', 
        'option_updated'              => 'Оновлено', 
        'option_new'                  => 'Нове', 
        'option_imported'             => 'Імпортоване', 
        'button_add_row'              => 'Додати ключове слово', 
        'button_import'               => 'Імпорт CSV', 
        'button_save_all'             => 'Зберегти все', 
        'button_add_to_beginning'     => 'Додати в початок', 
        'button_add_to_end'           => 'Додати в кінець', 
        'button_replace'              => 'Замінити', 
        'button_find_duplicates'      => 'Знайти дублі', 
        'button_clear_filters'        => 'Очистити фільтри', 
        'button_add_to_page'          => 'Додати до сторінки', 
        'button_copy'                 => 'Копіювати', 
        'button_delete'               => 'Видалити', 
        'button_move_up'              => 'Вгору', 
        'button_move_down'            => 'Вниз', 
        'button_remove_keyword'       => 'Видалити', 
        'text_search'                 => 'Пошук', 
        'confirm_replace'             => 'Замінити значення на "{{ text }}" у всіх відфільтрованих рядках?', 
        'confirm_add_to_beginning'    => 'Додати "{{ text }}" на початок у всіх відфільтрованих рядках?', 
        'confirm_add_to_end'          => 'Додати "{{ text }}" в кінець у всіх відфільтрованих рядках?', 
        'new_group_placeholder'       => 'Назва нової групи', 
        'button_add_group'            => 'Додати групу', 
      ], 
    ],
    'meta_editor' => [
      'navigation_label'      => 'Редактор метаданих',
      'model_label_singular'  => 'Редактор метаданих',
      'fields' => [
        'formula'       => 'Формула',
        'target_field'  => 'Цільове поле',
        'locale'        => 'Мова',
        'currency_id'   => 'Валюта',
      ],
      'buttons' => [
        'add_formula'                 => 'Додати формулу',
        'add_to_results'              => 'Додати до проміжної таблиці',
        'save_formulas'               => 'Зберегти формули',
        'apply_formula'               => 'Сгенерувати',
        'apply_formula_all'           => 'Згенерувати все',
        'save_staging'                => 'Зберегти зміни',
        'clear_staging'               => 'Очистити зміни',
        'edit'                        => 'Редагувати основний запис',
        'delete'                      => 'Видалити з тимчасової таблиці',
      ],
      'filters' => [
        'incomplete'                  => 'Незаповнені поля',
        'incomplete_all'              => 'Всі',
        'incomplete_true'             => 'Тільки незаповнені',
        'incomplete_false'            => 'Тільки заповнені',
      ],
      'helpers' => [
        'formula_placeholder'         => 'Тіги, що підтримуються: {{name}}, {{manufacturer}}, {{price}}, {{minPrice}}, {{maxPrice}}',
        'results_table_title'         => 'Проміжна таблиця',
        'results_table_descriptions'  => 'Виберіть рядки з таблиці вище, натиснувши кнопку "Додати до проміжної таблиці". Рядки, які відображаються тут, можна редагувати по одній або масово, застосувавши формулу генерації. Рядки зберігаються лише після натискання кнопки "Зберегти". Якщо деякі рядки не вдається згенерувати (наприклад, відсутнє значення токена), вони будуть пропущені під час процесу збереження. Ви можете відредагувати їх вручну, щоб виправити помилки, та зберегти їх після цього',
        'formulas_heading'            => 'Формули генерації',
        'formulas_subheading'         => 'Створіть формули тут. Збережіть формули перед їх використанням',
        'formulas_section'            => 'Довідка з формул',
        'formulas_description'        => ' 
          <p class="fi-callout-description">Базове використання: {{token}} у фігурних дужках</p>
          <p class="fi-callout-description">Підтримувані токени:</p>
            <ul class="fi-callout-description">
              <li><b style="user-select: all">{{name}}</b> - назва сутності</li>
              <li><b style="user-select: all">{{parent}}</b> - батьківський елемент сутності, наприклад: батьківська категорія, батьківський виробник тощо.</li>
              <li><b style="user-select: all">{{manufacturer}}</b> - виробник, застосовується тільки для товарів та сторінок фільтрів (якщо сторінка фільтра має виробника)</li>
              <li><b style="user-select: all">{{store}}</b> - назва магазину</li>
              <li><b style="user-select: all">{{price}}</b> - ціна, застосовується тільки для товарів</li>
              <li><b style="user-select: all">{{minPrice}}</b> - мінімальна ціна. Найнижча ціна в категоріях, виробниках та сторінках фільтрів. Найнижча ціна для варіанта товару, якщо товар має варіанти</li>
              <li><b style="user-select: all">{{maxPrice}}</b> - максимальна ціна. Найвища ціна в категоріях, виробниках та сторінках фільтрів. Найвища ціна для варіанта товару, если товар має варіанти</li>
              <li><b style="user-select: all">{{ratingAvg}}</b> - середній рейтинг товару. Для категорій, виробників та сторінок фільтрів розраховується середній рейтинг усіх пов\'язаних товарів</li>
              <li><b style="user-select: all">{{productCount}}</b> - кількість товарів</li>
            </ul>
            <p class="fi-callout-description">До токенів можна застосовувати фільтри через двокрапку: {{token:upper}}, {{token:lower}}, {{token:capitalize}}, {{token:number}}, {{token:currency}}. Приклад: {{store:upper}}, {{parent:lower}}</p>
            <p class="fi-callout-description">Токени можна об\'єднувати в ланцюжки за допомогою вертикальної риски: {{manufacturer|parent|name}}. У цьому випадку буде використано перший ненульовий токен.</p>
            <p class="fi-callout-description">Рядкові заглушки (літерали) можна додавати за допомогою вертикальної риски та тексту в подвійних лапках, якщо токен порожній: {{token|"текст літералу"}}. Текст літералу з\'явиться, якщо всі попередні токени в ланцюжку виявляться порожніми</p>
            <p class="fi-callout-description">Префікси та суфікси можна додавати до токена, зв\'язуючи їх вертикальною рискою: {{minPrice|prefix:" від "|suffix:" та інші пропозиції "}}</p>
            <p class="fi-callout-description">Повні приклади:</p>
            <ul class="fi-callout-description">
              <li>Купити {{name}} та інші {{parent:lower|"високоякісні товари"}} від {{minPrice:currency}} у нашому магазині {{store:upper}}</li>
            </ul>
        ',
      ],
      'messages' => [
        'saved_with_errors'           => 'У деяких рядках були помилки під час генерації, і вони не були збережені. Кількість помилкових рядків -: count. Дивіться помилкові рядки в проміжній таблиці',
        'staging_saved'               => 'Всі рядки збережені! Відмінна робота!',
      ],
    ],
  ],
  'blog' => [
    'authors'  => [
      'navigation_label'      => 'Автори',
      'model_label_singular'  => 'Автор',
      'fields'  => [
        'avatar'          => 'Аватар',
        'name'            => 'Ім\'я',
        'sort_order'      => 'Сортування',
        'is_active'       => 'Активний',
        'created_at'      => 'Дата створення',
        'posts_count'     => 'Кілкість статей',
        'social_links'    => 'Соціальні мережі автора',
        'social_platform' => 'Платформа',
        'social_url'      => 'URL',
      ],
      'buttons' => [
        'add_social_link' => 'Додати соціальну мережу автора'
      ],
      'helpers' => [
        'avatar' => 'відображається в кожному пості і на сторінці автора'
      ],
    ],
    'comments' => [
      'navigation_label'      => 'Відгуки',
      'model_label_singular'  => 'Відгук',
      'fields' => [
        'post'               => 'Стаття',
        'type'               => 'Тип',        
        'author'             => 'Автор',
        'email'              => 'Email',
        'body'               => 'Відгук',
        'rating'             => 'Рейтинг',
        'is_approved'        => 'Ухавлений',
        'created_at'         => 'Дата створення',
        'reply_body'         => 'Відповідь',
        'locale'             => 'Мова',
        'thread'             => 'Відповіді',
        'reply_author'       => 'Автор відповіді',
      ],
      'filters' => [
        'is_approved'        => 'Схвалені коментарі',
        'rating'             => 'Рейтинг',
      ],
      'actions' => [
        'reply'              => 'Відповісти',
      ],
      'notifications' => [
        'reply_sent'         => 'Відповідь додана',
      ],
      'labels' => [
        'admin_reply'        => 'Відповідь админістратора',
        'customer_comment'   => 'Коментар кліента',
        'store_reply_author' => 'Адміністратор',
      ]
    ],
    'tags'  => [
      'navigation_label'      => 'Теги',
      'model_label_singular'  => 'Тег',
      'fields'  => [
        'name'        => 'Назва',
        'sort_order'  => 'Сортування',
        'is_active'   => 'Активний',
        'is_menu'     => 'Відображати в меню',
        'created_at'  => 'Дата створення',
        'posts_count' => 'Статті',
      ],
      'helpers' => [
        'manage_posts_title' => 'Статті в тегу ":name"',
      ],
    ],
    'posts' => [
      'navigation_label'      => 'Статті',
      'model_label_singular'  => 'Стаття',
      'fields'  => [
        'image'       => 'Фото',
        'name'        => 'Назва',
        'sort_order'  => 'Сортування',
        'is_active'   => 'Активна',
        'created_at'  => 'Дата створення',
      ],
      'helpers' => [
        'tags' => 'З якими тегами пов\'язана ця стаття'
      ],
    ]
  ],
  'common' => [
    'fields' => [
      'name'              => 'Назва',
      'slug'              => 'URL',
      'description_short' => 'Короткий опис',
      'description_full'  => 'Повний опис',
      'h1'                => 'H1',
      'meta_title'        => 'Meta title',
      'meta_description'  => 'Meta description',
      'faq_question'      => 'Питання',
      'faq_answer'        => 'Відповідь',
      'how_to_step_name'  => 'Назва крока/етапа',
      'how_to_step_text'  => 'Опис крока/етапа',
      'image'             => 'Зображення',
      'image_description' => 'Опис',
      'footer_tab'        => 'Назва вкладки',
      'footer_content'    => 'Вміст вкладки',
      'created_at'        => 'Дата створення',
      'updated_at'        => 'Дата змінення',
      'is_active'         => 'Активний',
      'ai_result'         => 'Результат'
    ],
    'helpers' => [
      'name'                      => 'Ім\'я',
      'slug'                      => 'Має бути унікальним кожною мовою в магазині',
      'description_short'         => 'Вступний текст, який відображається над всіма іншими блоками. рекомендована довжина - до 500 символів',
      'description_full'          => 'Повний опис',
      'h1'                        => 'Додайте основні ключові слова, зробіть схожим на title',
      'meta_title'                => 'Додайте основні ключові слова. Рекомендована довжина - 50-60 символів. Довший заголовок буде обрізаний Google. Максимальна довжина - 160 символів',
      'meta_description'          => 'Рекомендована довжина - 120 символів для мобільних пристроїв та 150 символів для настільних комп\'ютерів. Довший опис буде обрізаний Google. Максимальна довжина - 255 символів',
      'image_description'         => 'Alt атрибут зображення, найкраще до 125 символів',
      'images_tab'                => 'Не забудьте заповнити атрибут Alt для зображення, це допоможе пошуковим системам зрозуміти, что зображено, та, відповідно, покращить SEO-рейтинг',
      'footer_tab'                => 'Тут можна додати контент у вигляді вкладок, в основному для SEO, щоб наповнити сторінку відсутніми ключовими словами',
      'faq_tab'                   => 'FAQ відобразиться під повним описом у вигляді згортаємих блоків Питання/відповідь',
      'how_to_tab'                => 'HowTo відобразиться під повним описом у вигляді кроків і вказань',
      'image_type_not_set_title'  => 'Розміри зображень не задано',
      'image_type_not_set_info'   => 'Відсутні настройки розірів зображень для <b>:type</b>! Встановіть ці розміри в налаштуваннях у розділі Дизайн/Зображення, щоб додати картинки до цієї сторінки',
      'manager_page_title'        => ':entities пов\'язані з :name',
      'manager_page_modal_title'  => 'Прив\'язати :entities до :name',
    ],
    'tabs' => [
      'content'     => 'Контент',
      'description' => 'Опис',
      'faq'         => 'FAQ',
      'how_to'      => 'HowTo',
      'images'      => 'Зображення',
      'footer'      => 'Футер',
      'relations'   => 'Зв\'язки',
      'general'     => 'Основні',
    ],
    'buttons' => [
      'save'              => 'Зберегти',
      'cancel'            => 'Скасувати',
      'edit'              => 'Редагувати',
      'filter'            => 'Фільтр',
      'columns'           => 'Колонки',
      'add_faq_row'       => 'Додати нове Питання/Відпвідь',
      'add_image_row'     => 'Додати нове фото',
      'add_how_to_step'   => 'Додати крок/етап HowTo',
      'add_how_to_tool'   => 'Додати інструмент HowTo',
      'add_how_to_supply' => 'Додати необхіну річ для HowTo',
      'add_footer_tab'    => 'Додати вкладку Footer',
      'create_slug'       => 'Створити URL із назви',
      'paste_h1'          => 'Вставити назву в H1',
      'paste_title'       => 'Вставити H1 або назву в Title',
      'paste_description' => 'Вставити Title в початок Description',
      'attach_record'     => 'Прив\'язати',
      'meta_editor'       => 'Редактор метаданих',
      'ai_action'         => 'AI генератор',
      'ai_generate'       => 'Сгенерувати',
      'ai_action_replace' => 'Замінити',
      'ai_action_append'  => 'Додати в кінець',
    ],
  ],
  'design' => [
    'menu_editor' => [
      'navigation_label'  => 'Головне меню',
      'subheading'        => 'Тут можна змінити наповення головного меню',
      'blocks' => [
        'category'          => 'Категорія',
        'manufacturer'      => 'Виробник',
        'title'             => 'Заголовок',
        'rich_text'         => 'Форматований текст',
        'product_card'      => 'Карточка товара',
      ],
      'buttons' => [
        'add_element'       => 'Додати елемент меню',
        'add_between'       => 'Додати між елементами',
      ],
    ],
    'layout_editor' => [
      'navigation_label'    => 'Редактор макетів',
      'subheading'          => 'Тут можна змінити розташування блоків на основних сторінках',
    ],
    'image_settings' => [
      'navigation_label'    => 'Зображення',
      'subheading'          => 'Тут можна змінити логотип магазина і задати глобальні розміри зображень',
      'logo'                => 'Логотип',
      'product'             => 'Товар',
      'category'            => 'Категорія',
      'manufacturer'        => 'Виборник',
      'blog'                => 'Блог',
      'product_miniature'   => 'Товар - мініатюра',
      'product_main'        => 'Товар - основне',
      'options_attributes'  => 'Опції і атрибути',
      'options'             => 'Опції',
      'attributes'          => 'Атрибути',
      'blog_miniature'      => 'Блог - мініатюра',
      'blog_main'           => 'Блог - основне',
      'category_miniature'  => 'Категорія - мініатюра',
      'category_main'       => 'Категорія - основне',
      'slider'              => 'Слайдер',
      'misc'                => 'Інші',
      'image_type'          => 'Тип зображення',
      'width'               => 'Ширина (px)',
      'height'              => 'Висота (px)',
    ],
    'css_editor' => [
      'navigation_label'  => 'Редактор CSS',
      'subheading'        => 'Тут ви можете додати стилі CSS, що перевизначаються, які відповідають основному файлу CSS. Основний файл CSS не змінюється',
    ],
  ],
  'navigation' => [
    'groups' => [
      'orders'          => 'Замовлення',
      'catalog'         => 'Каталог',
      'blog'            => 'Блог',
      'stock'           => 'Склад',
      'customers'       => 'Клієнти',
      'seo'             => 'SEO',
      'design'          => 'Дизайн',
      'store_settings'  => 'Налаштування магазина',
      'global_settings' => 'Глобальні налаштування',
    ],
  ],

  'store_homepage'  => ['navigation_label' => 'Головна',],

  // Store contacts form
  'store_contacts' => [
    'navigation_label' => 'Контакти',
    'fields' => [
      'legal_infos'                => 'Юридична інформація',
      'organization_description'   => 'Опис організації',
      'local_business_description' => 'Опис фізичного магазину',
      'legal_name'                 => 'Юридична назва',
      'address_details'            => 'Адреса',
      'country'                    => 'Країна',
      'region'                     => 'Регіон або код області',
      'city'                       => 'Місто',
      'street'                     => 'Вулиця, номер будинку',
      'iso_code'                   => 'ISO-код країни',
      'postal_code'                => 'Поштовий індекс',
      'geo_infos'                  => 'Географічні координати',
      'latitude'                   => 'Широта',
      'longitude'                  => 'Довгота',
      'email'                      => 'Електронна пошта',
      'open_hours'                 => 'Години роботи',
      'day'                        => 'День тижня',
      'opens'                      => 'Відчиняється',
      'closes'                     => 'Зачиняється',
      'phones'                     => 'Номери телефонів',
      'phone_name'                 => 'Назва телефону (Робочий, Сервіс, Підтримка тощо)',
      'phone_number'               => 'Номер телефону',
      'social_links'               => 'Посилання на соціальні мережі',
      'social_link_icon'           => 'Іконка',
      'social_link_title'          => 'Назва',
      'social_link_link'           => 'Посилання',
      'social_contacts'            => 'Контакти в месенджерах (WhatsApp, Viber тощо)',
      'social_contact_icon'        => 'Іконка',
      'social_contact_title'       => 'Назва',
      'social_contact_link'        => 'Посилання',
    ],
    'helpers' => [
      'legal_name'                 => 'Юридична назва компанії. Використовується в мікророзмітці JSON-LD та на сторінці «Про нас»',
      'organization_description'   => 'Короткий опис вашої компанії у кількох реченнях. Використовується в мікророзмітці JSON-LD та на сторінці «Про нас»',
      'local_business_description' => 'Короткий опис точки продажів (фізичного магазину) у кількох реченнях. Використовується в мікророзмітці JSON-LD та на сторінці «Про нас». Якщо у вас немає офлайн-магазину, це поле можна залишити порожнім',
      'country'                    => 'Назва країни звичайною мовою. Використовується на сторінці «Про нас» та в мікророзмітці JSON-LD для відображення розширених результатів пошуку Google',
      'region'                     => 'Назва регіону звичайною мовою. Використовується на сторінці «Про нас» та в мікророзмітці JSON-LD для відображення розширених результатів пошуку Google',
      'city'                       => 'Назва міста звичайною мовою. Використовується на сторінці «Про нас» та в мікророзмітці JSON-LD для відображення розширених результатів пошуку Google',
      'street'                     => 'Назва вулиці та номер будинку звичайною мовою. Використовується на сторінці «Про нас» та в мікророзмітці JSON-LD для відображення розширених результатів пошуку Google',
      'iso_code'                   => 'Дволітерний ISO-код країни у форматі ISO 3166-1 alpha-2: UA, PL, US, GB тощо. Використовується на сторінці «Про нас» та в мікророзмітці JSON-LD',
      'postal_code'                => 'Поштовий індекс за адресою реєстрації або розташування компанії. Підвищує довіру пошукових систем до інформації про компанію',
      'latitude'                   => 'Формат: 50.450100 (десяткові градуси). Допомагає Google Maps визначити розташування вашого магазину. Якщо у вас немає точки продажів (фізичного магазину), це поле можна залишити порожнім',
      'longitude'                  => 'Формат: 30.523400 (десяткові градуси). Допомагає Google Maps визначити розташування вашого магазину. Якщо у вас немає точки продажів (фізичного магазину), це поле можна залишити порожнім',
      'open_hours'                 => 'Приклад дня тижня: <u><b>Monday</b></u> - завжди англійською,<br>приклад часу роботи: <u><b>10:30</b></u>',
      'social_contacts'            => 'Посилання на месенджери: Viber, Facebook messenger, WhatsApp, тощо. Іконки можна додати в форматі SVG, назва - просто заголовок<br><b>Приклади посилань:</b>
        <ul class="fi-sc-unordered-list">
          <li><u><b>Viber:</b></u> viber://contact?number=%2B{НомерТелефонаБезЗнакаПлюс}</li>
          <li><u><b>WhatsApp:</b></u> https://wa.me/{НомерТелефонаБезЗнакаПлюс}</li>
          <li><u><b>Telegram:</b></u> https://t.me/{ВашАкаунтТелеграм}</li>
          <li><u><b>Facebook Messenger:</b></u> https://m.me/{ВашАкаунтФейсбук}</li>
        </ul>
      ',
    ],
    'buttons' => [
      'add_open_hours'     => 'Додати час роботи',
      'add_phone'          => 'Додати номер телефона',
      'add_social_link'    => 'Додати соціальне посилання',
      'add_social_contact' => 'Додати соціальний контакт',
    ],
  ],

  // Store settings
  'store_settings' => [
    'navigation_label' => 'Налаштування',
    'tabs' => [
      'delivery_settings'       => 'Доставка',
      'checkout_settings'       => 'Замовлення',
      'legal_settings'          => 'Правові налаштування',
      'tax_settings'            => 'Податки',
      'analytics_settings'      => 'Аналітка',
      'seo_defaults'            => 'SEO за замовченням',
      'notification_settings'   => 'Повідомлення',
      'maintenance'             => 'Режим обслуговування',
    ],
    'delivery_settings' => [
      'fields' => [
        'transit_min'   => 'Мінімальний час доставки (дні)',
        'transit_max'   => 'Максимальний час доставки (дні)',
        'handling_min'  => 'Мінімальний час обробки (дні)',
        'handling_max'  => 'Максимальний час обробки (дні)',
        'return_cost'   => 'Вартість повернення',
      ],
      'helpers' => [
        'transit'     => 'Це значення використовується в розмітці JSON-LD для відображення розширених сніпетів Google і лише як резервне значення. Фактичний час доставки може відрізнятися',
        'handling'    => 'Це значення використовується в розмітці JSON-LD для відображення розширених сніпетів Google і лише як резервне значення. Фактичний час обробки може відрізнятися',
        'return_cost' => 'Це значення використовується в розмітці JSON-LD для відображення розширених сніпетів Google і лише як резервне значення',
      ]
    ],
    'checkout_settings' => [
      'fields' => [
        'minimal_order_total'     => 'Мінімальна сума замовлення',
        'agreement_pages'         => 'Сторінки згоди',
        'service_agreement_page'  => 'Угода користування',
        'return_rules_page'       => 'Правила повернення',
        'checkout_custom_fields'  => 'Додаткові поля',
        'checkout_address_fields' => 'Поля адреси',
        'firstname'               => 'Ім\'я',
        'lastname'                => 'Прізвище',
        'building'                => 'Будинок',
        'apartment'               => 'Квартира',
        'postal_code'             => 'Поштовий індекс',
        'region'                  => 'Регіон',
        'phone'                   => 'Телефон',
        'payer'                   => 'Платник',
        'country'                 => 'Країна',
        'city'                    => 'Місто',
        'street'                  => 'Вулиця',
        'vat_number'              => 'Номер ІПН',
        'company'                 => 'Компанія',
        'time'                    => 'Вибір часу',
        'date'                    => 'Вибір дати',
        'datetime'                => 'Вибір дати та часу',
        'text'                    => 'Текст',
        'textarea'                => 'Текстове поле (textarea)',
        'checkbox'                => 'Чекбокс',
        'add_field'               => 'Додати поле',
        'field_type'              => 'Тип поля',
        'field_name'              => 'Назва поля',
        'is_required'             => 'Обов\'язкове',
      ],
      'helpers' => [
        'checkout_fields' => 'Поля оформлення замовлення, такі як адреса та ім\'я одержувача, які будуть відображатися в кошику',
        'custom_fields'   => 'Додаткові поля оформлення замовлення, такі як бажана дата доставки',
        'service_agreement_page' => 'Буде відображатися як прапорець «Я прочитав(-ла) і погоджуюся з Угодою про надання послуг» на сторінці оформлення замовлення. Пропустіть це, якщо вам це не потрібно',
        'return_rules_page' => 'Буде відображатися як прапорець «Я прочитав(-ла) і погоджуюся з Правилами повернення» на сторінці оформлення замовлення. Пропустіть це, якщо вам це не потрібно',
      ],
    ],
  ],

  // Stores
  'stores' => [
    'navigation_label'      => 'Магазини',
    'model_label_singular'  => 'Магазин',
    'fields' => [
      'name'                => 'Назва',
      'host'                => 'Домен',
      'languages'           => 'Мови',
      'currencies'          => 'Валюти',
      'countries'           => 'Країни',
      'is_active'           => 'Активний',
      'add_language'        => 'Додати мову магазину',
      'add_currency'        => 'Додати валюту магазину',
      'add_country'         => 'Додати країну магазину',
    ],
    'relations' => [
      'languages' => [
        'is_default' => 'Основна мова',
        'is_active'  => 'Активний',
      ],
    ],
    'helpers' => [
      'name'              => 'Назва магазина, тільки для адмінки',
      'host'              => 'Доменне ім\'я магазина без http:// або https://. <br> Приклад: <u><b>store.com</b></u>',
      'host_placeholder'  => 'store.com'
    ],
    'store_settings' => [
      'tabs' => [
        'ai_settings' => [
          'tab_label' => 'Налаштування AI',
          'labels' => [
            'prompt_settings'   => 'Налаштування промптів',
            'providers'         => 'Провайдери послуг',
            'name'              => 'Назва промпту',
            'prompt'            => 'Промпт',
            'prompt_text'       => 'Текст промпту',
            'prompt_extra'      => 'Додатковий промпт',
            'api_key'           => 'Ключ API',
            'provider'          => 'Провайдер',
            'endpoint'          => 'URL-адреса ендпоїнту',
            'model'             => 'Модель'
          ],
          'helpers' => [
            'prompt_settings'   => 'Створіть тут готові промпти. Ви зможете обрати один із них або відредагувати його перед відправленням запиту до AI',
            'providers'         => 'Додайте сюди провайдера послуг AI. Ви можете додати кілька провайдерів і пізніше обрати потрібний у модальному вікні на будь-якій сторінці редагування',
            'prompt'            => 'Промпт для моделі AI',
            'select_prompt'     => 'Оберіть провайдера і промпт',
            'no_settings'       => 'Щоб користуватись функціями AI спочатку налаштуйте провайдер AI і ключ API в розділі <a href=":url" style="color: var(--primary-500); font-weight: 600; text-decoration: underline;" target="_blank">Налаштування</a>',
          ],
          'buttons' => [
            'add_prompt'        => 'Додати новий промпт',
            'add_provider'      => 'Додати провайдера',
          ],
          'columns' => [
            'prompts'           => 'Промпти',
            'providers'         => 'Провайдери',
            'provider_settings' => 'Налаштування',
            'is_default'        => 'За замовчуванням',
          ],
        ],
      ],
    ],
    // Info pages
    'info_pages' => [
      'navigation_label'     => 'Інфо сторінки',
      'model_label_singular' => 'Інфо сторінка',
      'helpers' => [
        'group_title' => 'Інфо сторінки - це сторінки з основною інформацією про магазин, такою як контакти, правила доставки та оплати, правові положення'
      ]
    ],
  ],

  // Users
  'users' => [
    'navigation_label' => 'Користувачі',
    'model_label_singular' => 'Користувач',
    'fields' => [
      'name'        => 'Ім\'я',
      'email'       => 'Email',
      'role'        => 'Тип',
      'password'    => 'Пароль',
      'locale'      => 'Мова інтерфейса',
      'created_at'  => 'Дата створення',
      'is_active'   => 'Активний',
    ],
  ],

  'global' => [
    // Currencies
    'currencies' => [
      'navigation_label'      => 'Валюти',
      'model_label_singular'  => 'Валюта',
      'fields' => [
        'name'          => 'Назва',
        'iso_code'      => 'Код ISO',
        'sign'          => 'Знак валюти',
        'rate'          => 'Курс',
        'rate_default'  => 'Основна',
        'is_active'     => 'Активна',
      ],
      'helpers' => [
        'name'          => 'Назва валюти в панелі адміністратора',
        'iso_code'      => 'Код ISO використовується в розмітці JSON-LD',
        'sign'          => 'Знак використовується для відображення цін у фронтенді та бекенді',
        'rate'          => 'Обмінний курс до вашої валюти за замовчуванням',
        'rate_default'  => 'Ця валюта використовується для розрахунку курсів інших валют. Ця настройка задається глобально для всіх магазинів - тільки для розрахунку курсів',
      ],
    ],

    // Languages
    'languages' => [
      'navigation_label'      => 'Мови',
      'model_label_singular'  => 'Мова',
      'fields' => [
        'flag'                      => 'Прапорець',
        'name'                      => 'Назва',
        'iso_code'                  => 'Код ISO',
        'locale'                    => 'Локаль',
        'is_active'                 => 'Активна',
        'stores'                    => 'Магазини',
        'default_currency'          => 'Валюта',
        'fulltext_search_language'  => 'Словник PostgreSQL',
        'is_default'                => 'Основна мова'
      ],
      'helpers' => [
        'name'                      => 'Назва мови в панелі адміністратора',
        'iso_code'                  => 'Приклад: <b>en-US</b>. Код ISO використовується в розмітці JSON-LD',
        'locale'                    => 'Дволітерне позначення мови відповідно до стандарта ISO. Наприклад: en, uk, pl. Локаль використовується в заголовку HTML, щоб вказати пошуковим системам мову сторінки',
        'default_currency'          => 'Валюта за замовчуванням визначена для відображення цін залежно від мови, щоб пошукові системи бачили правильні ціни залежно від мови. Це не впливає на клієнтів, вони все ще можуть змінювати відображену валюту',
        'fulltext_search_language'  => 'Морфологічний словник повнотекстового пошуку. Ви можете використовувати власний словник для PostgreSQL, але спочатку його потрібно буде встановити'
      ],
    ],
    
    // Countries
    'countries' => [
      'navigation_label'      => 'Країни',
      'model_label_singular'  => 'Країна',
      'fields' => [
        'name'                  => 'Назва',
        'localization_settings' => 'Настройки локалізації',
        'iso_code'              => 'ISO код',
        'phone_code'            => 'Код телефона',
        'default_currency_id'   => 'Основна валюта',
        'is_eu_member'          => 'Входить в ЕС',
        'regions'               => 'Області',
        'region'                => 'Область',
        'add_region'            => 'Додати область',
        'is_active'             => 'Активна',
      ],
      'helpers' => [
        'add_region'  => 'Необов\'язково, ви можете пропустити це',
        'iso_code'    => 'ISO-код країни у дволітерному форматі ISO 3166-1 alpha-2: UA, PL, US, GB тощо. ISO-код використовується в мікроданих JSON-LD для відображення розширених сніпетів Google',
        'phone_code'  => 'Телефонний код країни: +380, +48, ​​+1, +44 для форматування телефонів під час оформлення замовлення',
      ],
    ],

    // Store wizard
    'store_wizard' => [
      'navigation_label' => 'Майстер налаштування',
      'fields' => [
        'existing_currency' => 'Використовувати існуючу валюту',
        'new_currency'      => 'Створити валюту',
        'existing_language' => 'Використовувати існуючу мову',
        'new_language'      => 'Створити мову',
        'existing_country'  => 'Використовувати існуючу країну',
        'new_country'       => 'Створити країну',
      ],
      'messages' => [
        'currency_language_hint' => 'Валютою за замовчуванням для цієї мови буде встановлено :currency з попереднього кроку. Ви завжди можете змінити це налаштування в панелі адміністратора у розділі «Глобальні налаштування/Мови»',
        'currency_country_hint'  => 'Валютою за замовчуванням для цієї країни буде встановлено :currency з попереднього кроку. Ви завжди можете змінити це налаштування в панелі адміністратора у розділі «Глобальні налаштування/Країни»',
      ],
      'steps' => [
        'currency'  => 'Валюта',
        'language'  => 'Мова',
        'country'   => 'Країна',
        'store'     => 'Магазин',
      ],
      'actions' => [
        'create' => 'Створити магазин'
      ]
    ]
  ],
];